{"link": "https://codeforces.com//contest/1676/problem/B", "problemId": "1394654", "shortId": "1676B", "contest_number": "1676", "name": "B. Equal Candies", "statement": "There are  boxes with different quantities of candies in each of them. The -th box has  candies inside.You also have  friends that you want to give the candies to, so you decided to give each friend a box of candies. But, you don't want any friends to get upset so you decided to eat some (possibly none) candies from each box so that all boxes have the same quantity of candies in them. Note that you may eat a different number of candies from different boxes and you cannot add candies to any of the boxes.What's the minimum total number of candies you have to eat to satisfy the requirements?", "input": "The first line contains an integer  () — the number of test cases. The first line of each test case contains an integer  () — the number of boxes you have. The second line of each test case contains  integers  () — the quantity of candies in each box.", "output": "For each test case, print a single integer denoting the minimum number of candies you have to eat to satisfy the requirements.", "tutorial": "Because we can only eat candies from boxes. The only way to make all boxes have the same quantity of candies in them would be to make all candies contain a number of candies equal to the minimum quantity of candies a box initially has. So, we should find this minimum number, let's denote it as , and then for each box, there should be eaten  candies. So the answer would be the sum of  over all -s ().", "solution": "#include \"bits/stdc++.h\"\nusing namespace std;\n\nint main() {\n    int t; cin >> t;\n    while(t--) {\n        int n; cin >> n;\n        vector<int> a(n);\n        int mn = INT_MAX, ans = 0;\n        for(int i = 0; i < n; ++i) {\n            cin >> a[i];\n            mn = min(mn, a[i]);\n        }\n        for(int i = 0; i < n; ++i) {\n            ans += a[i] - mn;\n        }\n        cout << ans << \"\\n\";\n    }\n}", "interactive": false, "noSolution": false, "noTutorial": false}