{"link": "https://codeforces.com//contest/1807/problem/B", "problemId": "1838162", "shortId": "1807B", "contest_number": "1807", "name": "B. Grab the Candies", "statement": "Mihai and Bianca are playing with bags of candies. They have a row  of  bags of candies. The -th bag has  candies. The bags are given to the players in the order from the first bag to the -th bag. If a bag has an even number of candies, Mihai grabs the bag. Otherwise, Bianca grabs the bag. Once a bag is grabbed, the number of candies in it gets added to the total number of candies of the player that took it. Mihai wants to show off, so he wants to reorder the array so that at any moment (except at the start when they both have no candies), Mihai will have  candies than Bianca. Help Mihai find out if such a reordering exists.", "input": "The first line of the input contains an integer  () — the number of test cases. The first line of each test case contains a single integer  () — the number of bags in the array. The second line of each test case contains  space-separated integers  () — the number of candies in each bag.", "output": "For each test case, output \"\" (without quotes) if such a reordering exists, and \"\" (without quotes) otherwise. You can output the answer in any case (for example, the strings \"\", \"\", \"\" and \"\" will be recognized as a positive answer).", "tutorial": "Let  be the total number of candies with all bags with an even number of candies, and  — the total of all bags with an odd number of candies. If , then the answer is , because at the end Mihai (who takes only even numbers of candies) will have less candies than Bianca.Otherwise if  the answer is . The construction is to simply put all even bags first, and then all odd bags: since all even bags come before all odd bags and , at any point in time Mihai will have more candies than Bianca.The time complexity is .", "solution": "#include <bits/stdc++.h>\nusing namespace std;\n \nvoid solve()\n{\n    int n;\n    cin >> n;\n    int x, odd = 0, even = 0;\n    for(int i = 0; i < n; i++)\n    {\n        cin >> x;\n        if(x%2 == 0)\n        {\n            even+=x;\n        }\n        else\n        {\n            odd+=x;\n        }\n    }\n    if(even > odd)\n    {\n        cout << \"YES\" << endl;\n    }\n    else\n    {\n        cout << \"NO\" << endl;\n    }\n}\n \nint32_t main(){\n    int t = 1;\n    cin >> t;\n    while (t--) {\n        solve();\n    }\n}\n \n \n\n", "interactive": false, "noSolution": false, "noTutorial": false}