{"link": "https://codeforces.com//contest/1742/problem/C", "problemId": "1584058", "shortId": "1742C", "contest_number": "1742", "name": "C. Stripes", "statement": "On an  grid, some horizontal rows have been painted red, and some vertical columns have been painted blue, in some order. The stripes are drawn sequentially, one after the other. When the stripe is drawn, it repaints all the cells through which it passes.Determine which color was used last.   ", "input": "The first line of the input contains a single integer  () — the number of test cases. The description of test cases follows. There is an empty line before each test case. Each test case consists of  lines, each containing  characters. Each of these characters is either '', '', or '', denoting a red square, a blue square, and an unpainted square, respectively. It is guaranteed that the given field is obtained from a colorless one by drawing horizontal red rows and vertical blue columns. At least one stripe is painted.", "output": "For each test case, output '' if a red stripe was painted last, and '' if a blue stripe was painted last (without quotes).", "tutorial": "Note that if a stripe is painted last, then the entire stripe appears in the final picture (because no other stripe is covering it).Since rows are only painted red and columns are only painted blue, we can just check if any row contains 8 s. If there is such a row, then red was painted last; otherwise, blue was painted last.", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nconst int MAX = 200007;\nconst int MOD = 1000000007;\n\nvoid solve() {\n\tchar g[8][8];\n\tvector<int> r;\n\tfor (int i = 0; i < 8; i++) {\n\t\tfor (int j = 0; j < 8; j++) {\n\t\t\tcin >> g[i][j];\n\t\t\tif (g[i][j] == 'R') {r.push_back(i);}\n\t\t}\n\t}\n\tfor (int i : r) {\n\t    bool ok = true;\n\t    for (int j = 0; j < 8; j++) {\n\t        if (g[i][j] != 'R') {ok = false; break;}\n\t    }\n\t    if (ok) {cout << \"R\\n\"; return;}\n\t}\n\tcout << \"B\\n\";\n}\n\nint main() {\n\tios::sync_with_stdio(false);\n\tcin.tie(nullptr);\n\tint tt; cin >> tt; for (int i = 1; i <= tt; i++) {solve();}\n\t// solve();\n}", "interactive": false, "noSolution": false, "noTutorial": false}