{"link": "https://codeforces.com//contest/1722/problem/C", "problemId": "1524435", "shortId": "1722C", "contest_number": "1722", "name": "C. Word Game", "statement": "Three guys play a game: first, each person writes down  distinct words of length . Then, they total up the number of points as follows:   if a word was written by one person — that person gets 3 points,  if a word was written by two people — each of the two gets 1 point,  if a word was written by all — nobody gets any points.  In the end, how many points does each player have?", "input": "The input consists of multiple test cases. The first line contains an integer  () — the number of test cases. The description of the test cases follows. The first line of each test case contains an integer  () — the number of words written by each person. The following three lines each contain   strings — the words written by each person. Each string consists of  lowercase English characters.", "output": "For each test case, output three space-separated integers — the number of points each of the three guys earned. You should output the answers in the same order as the input; the -th integer should be the number of points earned by the -th guy.", "tutorial": "You need to implement what is written in the statement. To quickly check if a word is written by another guy, you should store some  or Python dictionary, and increment every time you see a new string in the input. Then, you should iterate through each guy, find the number of times their word appears, and update their score. The complexity is  per testcase.", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nconst int MAX = 200007;\nconst int MOD = 1000000007;\n\nvoid solve() {\n\tint n;\n\tcin >> n;\n\tmap<string, int> mp;\n\tstring a[3][n];\n\tfor (int i = 0; i < 3; i++) {\n\t\tfor (int j = 0; j < n; j++) {\n\t\t\tcin >> a[i][j];\n\t\t\tmp[a[i][j]]++;\n\t\t}\n\t}\n\tfor (int i = 0; i < 3; i++) {\n\t\tint tot = 0;\n\t\tfor (int j = 0; j < n; j++) {\n\t\t\tif (mp[a[i][j]] == 1) {tot += 3;}\n\t\t\telse if (mp[a[i][j]] == 2) {tot++;}\n\t\t}\n\t\tcout << tot << ' ';\n\t}\n\tcout << '\\n';\n}\n\nint main() {\n\tios::sync_with_stdio(false);\n\tcin.tie(nullptr);\n\tint tt; cin >> tt; for (int i = 1; i <= tt; i++) {solve();}\n\t// solve();\n}", "interactive": false, "noSolution": false, "noTutorial": false}