{"link": "https://codeforces.com//contest/1791/problem/E", "problemId": "1764445", "shortId": "1791E", "contest_number": "1791", "name": "E. Negatives and Positives", "statement": "Given an array  consisting of  elements, find the maximum possible sum the array can have after performing the following operation :   Choose   elements and flip both of their signs. In other words choose an index  such that  and assign  and . ", "input": "The input consists of multiple test cases. The first line contains an integer  () — the number of test cases. The descriptions of the test cases follow. The first line of each test case contains an integer  () — the length of the array. The following line contains  space-separated integers  (). It is guaranteed that the sum of  over all test cases does not exceed .", "output": "For each test case, output the maximum possible sum the array can have after performing the described operation any number of times.", "tutorial": "We can notice that by performing any number of operations, the parity of the count of negative numbers won't ever change. Thus, if the number of negative numbers is initially even, we can make it equal to  by performing some operations. So, for an even count of negative numbers, the answer is the sum of the absolute values of all numbers (since we can make all of them positive). And if the count of negative numbers is odd, we must have one negative number at the end. We will choose the one smallest by absolute value and keep the rest positive (for simplicity, we consider  as a negative number).", "solution": "#include <bits/stdc++.h>\nusing namespace std;\n\nint main() {\n    int t; cin >> t;\n    while(t--) {\n        int n; cin >> n;\n        vector<int> a(n);\n        long long sum = 0;\n        int negs = 0;\n        for(int i = 0; i < n; ++i) {\n            cin >> a[i];\n            if(a[i] < 0) {\n                ++negs;\n                a[i] = -a[i];\n            }\n            sum += a[i];\n        }\n        sort(a.begin(), a.end());\n        if(negs & 1) sum -= 2 * a[0];\n        cout << sum << \"\\n\";\n    }\n}", "interactive": false, "noSolution": false, "noTutorial": false}