{"link": "https://codeforces.com//contest/1352/problem/E", "problemId": "616897", "shortId": "1352E", "contest_number": "1352", "name": "E. Special Elements", "statement": "The array  () is given. Its element  is called special if there exists a pair of indices  and  () such that . In other words, an element is called special if it can be represented as the sum of  of an array (no matter if they are special or not).Print the number of special elements of the given array .For example, if  and , then the answer is :   is a special element, since ;   is a special element, since ;   is a special element, since ;   is a special element, since ;   is a special element, since . Please note that some of the elements of the array  may be equal — if several elements are equal and special, then all of them should be counted in the answer.", "input": "The first line contains an integer  () — the number of test cases in the input. Then  test cases follow. Each test case is given in two lines. The first line contains an integer  () — the length of the array . The second line contains integers  (). It is guaranteed that the sum of the values of  for all test cases in the input does not exceed .", "output": "Print  numbers — the number of special elements for each of the given arrays.", "tutorial": "The intended solution for this problem uses  time and  memory. Firstly, let's calculate  for each  from  to , where  is the number of occurrences of  in . This part can be done in .Then let's iterate over all segments of  of length at least  maintaining the sum of the current segment . We can notice that we don't need sums greater than  because all elements do not exceed . So if the current sum does not exceed  then add  to the answer and set  to prevent counting the same elements several times. This part can be done in .", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nint main() {\n\tint t;\n\tcin >> t;\n\twhile (t--) {\n\t\tint n;\n\t\tcin >> n;\n\t\tvector<int> a(n);\n\t\tvector<int> cnt(n + 1);\n\t\tint ans = 0;\n\t\tfor (auto &it : a) {\n\t\t\tcin >> it;\n\t\t\t++cnt[it];\n\t\t}\n\t\tfor (int l = 0; l < n; ++l) {\n\t\t\tint sum = 0;\n\t\t\tfor (int r = l; r < n; ++r) {\n\t\t\t\tsum += a[r];\n\t\t\t\tif (l == r) continue;\n\t\t\t\tif (sum <= n) {\n\t\t\t\t\tans += cnt[sum];\n\t\t\t\t\tcnt[sum] = 0;\n\t\t\t\t}\n\t\t\t}\n\t\t}\n\t\tcout << ans << endl;\n\t}\n}", "interactive": false, "noSolution": false, "noTutorial": false}