{"link": "https://codeforces.com//contest/1354/problem/A", "problemId": "623444", "shortId": "1354A", "contest_number": "1354", "name": "A. Alarm Clock", "statement": "Polycarp has spent the entire day preparing problems for you. Now he has to sleep for at least  minutes to feel refreshed. So he has just fallen asleep and his first alarm goes off in  minutes.Every time Polycarp wakes up, he decides if he wants to sleep for some more time or not. If he's slept for less than  minutes in total, then he sets his alarm to go off in  minutes after it is reset and spends  minutes to fall asleep again. Otherwise, he gets out of his bed and proceeds with the day.If the alarm goes off while Polycarp is falling asleep, then he resets his alarm to go off in another  minutes and tries to fall asleep for  minutes again.You just want to find out when will Polycarp get out of his bed or report that it will never happen.", "input": "The first line contains one integer  () — the number of testcases. The only line of each testcase contains four integers  () — the time Polycarp has to sleep for to feel refreshed, the time before the first alarm goes off, the time before every succeeding alarm goes off and the time Polycarp spends to fall asleep.", "output": "For each test case print one integer. If Polycarp never gets out of his bed then print . Otherwise, print the time it takes for Polycarp to get out of his bed.", "tutorial": "Let's handle some cases. Firstly, if  then Polycarp wakes up rested enough immediately, so  is the answer. Otherwise, what does Polycarp do? He sets alarm to go off in  minutes and falls asleep in  minutes. Thus, he spends  minutes sleeping. Notice that if  is non-positive, then Polycarp always resets his alarm without sleeping. So for that case the answer is .Finally, if Polycarp resets his alarm  times then he ends up with  minutes of sleep in total and ends up spending  minutes of time. We know that  should be greater or equal to  and  should be the smallest possible.  Thus, the smallest possible integer  is equal to . And the answer is .Overall complexity:  per testcase.", "solution": "t = int(input())\nfor _ in range(t):\n\ta, b, c, d = map(int, input().split())\n\tif b >= a:\n\t\tprint(b)\n\t\tcontinue\n\tif c <= d:\n\t\tprint(-1)\n\t\tcontinue\n\ta -= b\n\tdif = c - d\n\tprint(b + (a + dif - 1) // dif * c)", "interactive": false, "noSolution": false, "noTutorial": false}