{"link": "https://codeforces.com//contest/665/problem/A", "problemId": "55541", "shortId": "665A", "contest_number": "665", "name": "A. Buses Between Cities", "statement": "Buses run between the cities  and , the first one is at 05:00 AM and the last one departs not later than at 11:59 PM. A bus from the city  departs every  minutes and arrives to the city  in a  minutes, and a bus from the city  departs every  minutes and arrives to the city  in a  minutes.The driver Simion wants to make his job diverse, so he counts the buses going towards him. Simion doesn't count the buses he meet at the start and finish.You know the time when Simion departed from the city  to the city . Calculate the number of buses Simion will meet to be sure in his counting.", "input": "The first line contains two integers  () — the frequency of the buses from the city  to the city  and the travel time. Both values are given in minutes. The second line contains two integers  () — the frequency of the buses from the city  to the city  and the travel time. Both values are given in minutes. The last line contains the departure time of Simion from the city  in the format . It is guaranteed that there are a bus from the city  at that time. Note that the hours and the minutes are given with exactly two digits.", "output": "Print the only integer  — the number of buses Simion will meet on the way. Note that you should not count the encounters in cities  and .", "tutorial": "Consider the time interval when Simion will be on the road strictly between cities  (). Let's iterate over the oncoming buses. Let  be the time interval when the oncoming bus will be strictly between two cities. If the intersection of that intervals  is not empty than Simion will count that bus.\n", "solution": "int a, ta;\nint b, tb;\nint h, m;\n\nbool read() {\n\tif (!(cin >> a >> ta)) return false;\n\tassert(cin >> b >> tb);\n\tassert(scanf(\"%d:%d\", &h, &m) == 2);\n\treturn true;\n}\n\nvoid solve() {\n\tint x1 = h * 60 + m;\n\tint y1 = x1 + ta;\n\n\tint ans = 0;\n\tfor (int x2 = 5 * 60 + 0; x2 < 24 * 60; x2 += b) {\n\t\tint y2 = x2 + tb;\n\t\tint x = max(x1, x2), y = min(y1, y2);\n\t\tif (x < y)\n\t\t\tans++;\n\t}\n\tcout << ans << endl;\n}", "interactive": false, "noSolution": false, "noTutorial": false}