{"link": "https://codeforces.com//contest/1767/problem/A", "problemId": "1697000", "shortId": "1767A", "contest_number": "1767", "name": "A. Cut the Triangle", "statement": "You are given a non-degenerate triangle (a non-degenerate triangle is a triangle with positive area). The vertices of the triangle have coordinates ,  and .You want to draw a straight line to cut the triangle into . Furthermore, the line you draw should be .Can you draw the line to meet all the constraints?Here are some suitable ways to draw the line:  However, these ways to draw the line are not suitable (the first line cuts the triangle into a triangle and a quadrangle; the second line doesn't cut the triangle at all; the third line is neither horizontal nor vertical):  ", "input": "The first line contains one integer  () — the number of test cases. Each test case consists of four lines. The first of them is empty. The -th of the next three lines contains two integers  and  () — the coordinates of the -th vertex of the triangle. Additional constraint on the input: in each test case, the triangle formed by three vertices has positive area (i. e. it is non-degenerate).", "output": "For each test case, print  if it is possible to cut the triangle according to the statement, or  otherwise. You may print each letter in any case (, ,  will all be recognized as positive answer, ,  and  will all be recognized as negative answer).", "tutorial": "The line we draw must go through a triangle's vertex; otherwise, two sides of the triangle are split, and one of the resulting parts becomes a quadrilateral.So we need to check if it is possible to make a horizontal or vertical cut through a vertex. A horizontal cut is possible if all $$$y$$$-coordinates are different (we can draw it through a vertex with the median $$$y$$$-coordinate); a vertical cut is possible if all $$$x$$$-coordinates are different (we can draw it through a vertex with the median $$$x$$$-coordinate).So, all we need to check is the following pair of conditions:  all $$$x_i$$$ are different;  all $$$y_i$$$ are different. ", "solution": "t = int(input())\nfor i in range(t):\n    input()\n    xs = []\n    ys = []\n    for j in range(3):\n        x, y = map(int, input().split())\n        xs.append(x)\n        ys.append(y)\n    print('YES' if len(set(xs)) == 3 or len(set(ys)) == 3 else 'NO')", "interactive": false, "noSolution": false, "noTutorial": false}