{"link": "https://codeforces.com//contest/990/problem/A", "problemId": "188990", "shortId": "990A", "contest_number": "990", "name": "A. Commentary Boxes", "statement": "Berland Football Cup starts really soon! Commentators from all over the world come to the event.Organizers have already built  commentary boxes.  regional delegations will come to the Cup. Every delegation should get the  of the commentary boxes. If any box is left unoccupied then the delegations will be upset. If  is not divisible by , it is impossible to distribute the boxes to the delegations at the moment.Organizers can build a new commentary box paying  burles and demolish a commentary box paying  burles. They can both build and demolish boxes arbitrary number of times (each time paying a corresponding fee). It is allowed to demolish all the existing boxes.What is the minimal amount of burles organizers should pay to satisfy all the delegations (i.e. to make the number of the boxes be divisible by )?", "input": "The only line contains four integer numbers , ,  and  (, ), where  is the initial number of the commentary boxes,  is the number of delegations to come,  is the fee to build a box and  is the fee to demolish a box.", "output": "Output the minimal amount of burles organizers should pay to satisfy all the delegations (i.e. to make the number of the boxes be divisible by ). It is allowed that the final number of the boxes is equal to .", "tutorial": "Notice that you need to check just two numbers: the closest one less or equal to  and the closest one greater than . Distances to them are  and  respectively. Now you should multiply the first result by , the second result by  and compare the products.Overall complexity: .", "solution": "#include <bits/stdc++.h>\n\n#define forn(i, n) for(int i = 0; i < int(n); i++)\n \nusing namespace std;\n\nint main() {\n\tlong long n, m;\n\tint a, b;\n\t\n\tcin >> n >> m >> a >> b;\n\tcout << min(n % m * b, (m - n % m) * a) << endl;\n\treturn 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}