{"link": "https://codeforces.com//contest/1140/problem/A", "problemId": "317584", "shortId": "1140A", "contest_number": "1140", "name": "A. Detective Book", "statement": "Ivan recently bought a detective book. The book is so interesting that each page of this book introduces some sort of a mystery, which will be explained later. The -th page contains some mystery that will be explained on page  ().Ivan wants to read the whole book. Each day, he reads the first page he didn't read earlier, and continues to read the following pages one by one, until all the mysteries he read about are explained and clear to him (Ivan stops if there does not exist any page  such that Ivan already has read it, but hasn't read page ). After that, he closes the book and continues to read it on the following day from the next page.How many days will it take to read the whole book?", "input": "The first line contains single integer  () — the number of pages in the book. The second line contains  integers  (), where  is the number of page which contains the explanation of the mystery on page .", "output": "Print one integer — the number of days it will take to read the whole book.", "tutorial": "Solution is just some implementation: simulate algorithm given in the legend, maintaining maximum over all  on prefix and breaking when the maximum becomes smaller than index of the next page.", "solution": "#include<bits/stdc++.h>\nusing namespace std;\n\nint n;\nvector<int> a;\n\ninline bool read() {\n\tif(!(cin >> n))\n\t\treturn false;\n\ta.resize(n);\n\tfor(int i = 0; i < n; i++) {\n\t\tcin >> a[i];\n\t\ta[i]--;\n\t}\n\treturn true;\n}\n\ninline void solve() {\n\tint cnt = 0, pos = 0;\n\twhile(pos < n) {\n\t\tcnt++;\n\t\tint mx = pos;\n\t\twhile(pos < n && pos <= mx) {\n\t\t\tmx = max(mx, a[pos]);\n\t\t\tpos++;\n\t\t}\n\t}\n\tcout << cnt << endl;\n}\n\nint main() {\n#ifdef _DEBUG\n\tfreopen(\"input.txt\", \"r\", stdin);\n#endif\t\n\tif(read()) {\n\t\tsolve();\n\t}\n\treturn 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}