{"link": "https://codeforces.com//contest/1016/problem/A", "problemId": "204436", "shortId": "1016A", "contest_number": "1016", "name": "A. Death Note", "statement": "You received a notebook which is called . This notebook has infinite number of pages. A rule is written on the last page (huh) of this notebook. It says: \"You have to write names in this notebook during  consecutive days. During the -th day you have to write exactly  names.\". You got scared (of course you got scared, who wouldn't get scared if he just receive a notebook which is named  with a some strange rule written in it?).Of course, you decided to follow this rule. When you calmed down, you came up with a strategy how you will write names in the notebook. You have calculated that each page of the notebook can contain exactly  names. You will start writing names from the first page. You will write names on the current page as long as the limit on the number of names on this page is not exceeded. When the current page is over, you turn the page. Note that you  turn the page when it ends, it doesn't matter if it is the last day or not. If after some day the current page still can hold at least one name, during the next day you will continue writing the names from the current page.Now you are interested in the following question: how many times will you turn the page during each day? You are interested in the number of pages you will turn each day from  to .", "input": "The first line of the input contains two integers ,  (, ) — the number of days you will write names in the notebook and the number of names which can be written on each page of the notebook. The second line contains  integers  (), where  means the number of names you will write in the notebook during the -th day.", "output": "Print exactly  integers , where  is the number of times you will turn the page during the -th day.", "tutorial": "In this problem all we need is to maintain the variable  which will represent the number of names written on the current page. Initially this number equals zero. The answer for the -th day equals . This value represents the number of full pages we will write during the -th day. After the answering we need to set , where operation  is taking  modulo .", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nint main() {\n#ifdef _DEBUG\n\tfreopen(\"input.txt\", \"r\", stdin);\n//\tfreopen(\"output.txt\", \"w\", stdout);\n#endif\n\n\tint n, m;\n\tcin >> n >> m;\n\t\n\tint r = 0;\n\tfor (int i = 0; i < n; ++i) {\n\t\tint x;\n\t\tcin >> x;\n\t\t\n\t\tr += x;\n\t\tcout << r / m << ' ';\n\t\tr %= m;\n\t}\n\tcout << '\\n';\n\t\n\treturn 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}