{"link": "https://codeforces.com//contest/1036/problem/A", "problemId": "216417", "shortId": "1036A", "contest_number": "1036", "name": "A. Function Height", "statement": "You are given a set of  integer points on a Cartesian plane. Points are numbered from  to  inclusive. Let  be the -th point. The -coordinate of the point  equals . The -coordinate of the point  equals zero (initially). Thus, initially .The given points are vertices of a plot of a piecewise function. The -th piece of the function is the segment .In one move you can increase the -coordinate of any point with odd -coordinate (i.e. such points are ) by . Note that the corresponding segments also change.For example, the following plot shows a function for  (i.e. number of points is ) in which we increased the -coordinate of the point  three times and -coordinate of the point  one time:  Let the area of the plot be the area below this plot and above the coordinate axis OX. For example, the area of the plot on the picture above is 4 (the light blue area on the picture above is the area of the plot drawn on it).Let the height of the plot be the maximum -coordinate among all initial points in the plot (i.e. points ). The height of the plot on the picture above is 3.Your problem is to say which minimum possible height can have the plot consisting of  vertices and having an area equal to . Note that it is unnecessary to minimize the number of moves.It is easy to see that any answer which can be obtained by performing moves described above always exists and is an integer number not exceeding .", "input": "The first line of the input contains two integers  and  () — the number of vertices in a plot of a piecewise function and the area we need to obtain.", "output": "Print one integer — the minimum possible height of a plot consisting of  vertices and with an area equals . It is easy to see that any answer which can be obtained by performing moves described above always exists and is an integer number not exceeding .", "tutorial": "It is easy to see that the area of the plot is the sum of areas of all triangles in this plot. Each move increases area by one. We cannot obtain the answer less than  but we always can obtain such an answer.", "solution": "n, k = map(int, input().split())\nprint((k + n - 1) // n)", "interactive": false, "noSolution": false, "noTutorial": false}