{"link": "https://codeforces.com//contest/1681/problem/A", "problemId": "1408802", "shortId": "1681A", "contest_number": "1681", "name": "A. Game with Cards", "statement": "Alice and Bob play a game. Alice has  cards, the -th of them has the integer  written on it. Bob has  cards, the -th of them has the integer  written on it.On the first turn of the game,  chooses one of his/her cards and puts it on the table (plays it). On the second turn,  chooses one of his/her cards , and plays it. On the third turn,  chooses one of his/her cards , and plays it, and so on — the players take turns, and each player has to choose one of his/her cards with greater integer than the card played by the other player on the last turn.If some player cannot make a turn, he/she loses.For example, if Alice has  cards with numbers , and Bob has  cards with numbers , the game may go as follows:  Alice can choose any of her cards. She chooses the card with integer  and plays it.  Bob can choose any of his cards with number greater than . He chooses a card with integer  and plays it.  Alice can choose any of her cards with number greater than . She chooses the card with integer  and plays it.  Bob can choose any of his cards with number greater than . He chooses a card with integer  and plays it.  Alice can choose any of her cards with number greater than , but she has no such cards, so she loses. Both Alice and Bob play .You have to answer two questions:  who wins if Alice is the first player?  who wins if Bob is the first player? ", "input": "The first line contains one integer  () — the number of test cases. Each test case consists of four lines. The first line of a test case contains one integer  () — the number of cards Alice has. The second line contains  integers  () — the numbers written on the cards that Alice has. The third line contains one integer  () — the number of Bob's cards. The fourth line contains  integers  () — the numbers on Bob's cards.", "output": "For each test case, print two lines. The first line should be  if Alice wins when she is the first player; otherwise, the first line should be . The second line should contain the name of the winner if Bob is the first player, in the same format.", "tutorial": "Let the maximum card among all  cards be .If only one player has a card of value of , then he/she can win by playing it on the first turn or on the second turn; the opponent won't be able to respond with any of their cards.Otherwise (if both players have a card with value ), the player who plays this card earlier wins the game. So, in this case, the winner is the player who makes the first turn.", "solution": "t = int(input())\nfor i in range(t):\n    n = int(input())\n    a = list(map(int, input().split()))\n    m = int(input())\n    b = list(map(int, input().split()))\n    \n    print('Alice' if max(a) >= max(b) else 'Bob')\n    print('Alice' if max(a) > max(b) else 'Bob')", "interactive": false, "noSolution": false, "noTutorial": false}