{"link": "https://codeforces.com//contest/1009/problem/A", "problemId": "197472", "shortId": "1009A", "contest_number": "1009", "name": "A. Game Shopping", "statement": "Maxim wants to buy some games at the local game shop. There are  games in the shop, the -th game costs .Maxim has a wallet which can be represented as an array of integers. His wallet contains  bills, the -th bill has value .Games in the shop are ordered from left to right, Maxim tries to buy  game in that order.When Maxim stands at the position  in the shop, he takes the first bill from his wallet (if his wallet is empty then he proceeds to the next position immediately) and tries to buy the -th game using this bill. After Maxim tried to buy the -th game, he leaves the shop.Maxim buys the -th game if and only if the value of the first bill (which he takes) from his wallet is greater or equal to the cost of the -th game. If he successfully buys the -th game, the first bill from his wallet disappears and the next bill becomes first. Otherwise Maxim leaves the first bill in his wallet  and proceeds to the next game.For example, for array  and array  the following process takes place: Maxim buys the first game using the first bill (its value is ), the bill disappears, after that the second bill (with value ) becomes the first one in Maxim's wallet, then Maxim doesn't buy the second game because , the same with the third game, then he buys the fourth game using the bill of value  (the third bill becomes the first one in Maxim's wallet) and buys the fifth game using the bill of value .Your task is to get the number of games Maxim will buy.", "input": "The first line of the input contains two integers  and  () — the number of games and the number of bills in Maxim's wallet. The second line of the input contains  integers  (), where  is the cost of the -th game. The third line of the input contains  integers  (), where  is the value of the -th bill from the Maxim's wallet.", "output": "Print a single integer — the number of games Maxim will buy.", "tutorial": "Let's keep the variable  which will represent the number of games Maxim buy. Initially . Assume that arrays  and  are 0-indexed. Then let's iterate over all  and if  and  make . So  will be the answer after this cycle.", "solution": "n, m = map(int, input().split())\na = list(map(int, input().split()))\nb = list(map(int, input().split()))\npos = 0\nfor i in a:\n\tpos += (pos < len(b) and b[pos] >= i)\nprint(pos)", "interactive": false, "noSolution": false, "noTutorial": false}