{"link": "https://codeforces.com//contest/652/problem/A", "problemId": "52868", "shortId": "652A", "contest_number": "652", "name": "A. Gabriel and Caterpillar", "statement": "The -th grade student Gabriel noticed a caterpillar on a tree when walking around in a forest after the classes. The caterpillar was on the height  cm from the ground. On the height  cm () on the same tree hung an apple and the caterpillar was crawling to the apple.Gabriel is interested when the caterpillar gets the apple. He noted that the caterpillar goes up by  cm per hour by day and slips down by  cm per hour by night.In how many days Gabriel should return to the forest to see the caterpillar get the apple. You can consider that the day starts at  am and finishes at  pm. Gabriel's classes finish at  pm. You can consider that Gabriel noticed the caterpillar just after the classes at  pm.Note that the forest is magic so the caterpillar can slip down under the ground and then lift to the apple.", "input": "The first line contains two integers  () — the heights of the position of the caterpillar and the apple in centimeters. The second line contains two integers  () — the distance the caterpillar goes up by day and slips down by night, in centimeters per hour.", "output": "Print the only integer  — the number of days Gabriel should wait to return to the forest and see the caterpillar getting the apple. If the caterpillar can't get the apple print the only integer .", "tutorial": "Let's consider three cases.\n    — in this case the caterpillar will get the apple on the same day, so the answer is .   The first condition is false and  — in this case the caterpillar will never get the apple, because it can't do that on the first day and after each night it will be lower than one day before.   If the first two conditions are false easy to see that the answer equals to . \n", "solution": "int h1, h2;\nint a, b;\n\nbool read() {\n\treturn !!(cin >> h1 >> h2 >> a >> b);\n}\n\nvoid solve() {\n\tif (h1 + 8 * a >= h2)\n\t\tputs(\"0\");\n\telse if (a > b) {\n\t\tint num = h2 - h1 - 8 * a, den = 12 * (a - b);\n\t\tcout << (num + den - 1) / den << endl;\n\t} else\n\t\tputs(\"-1\");\n}", "interactive": false, "noSolution": false, "noTutorial": false}