{"link": "https://codeforces.com//contest/1809/problem/A", "problemId": "1839361", "shortId": "1809A", "contest_number": "1809", "name": "A. Garland", "statement": "You have a garland consisting of  colored light bulbs, the color of the -th light bulb is .Initially, all the light bulbs are turned off. Your task is to turn all the light bulbs on. You can perform the following operation any number of times: select a light bulb and switch its state (turn it on if it was off, and turn it off if it was on). The only restriction on the above operation is that you can apply the operation to a light bulb only if the previous operation was applied to a light bulb of a different color (the first operation can be applied to any light bulb).Calculate the minimum number of operations to turn all the light bulbs on, or report that this is impossible.", "input": "The first line contains a single integer  () — the number of test cases. The single line of each test case contains  — a sequence of  characters, where each character is a decimal digit. The -th character denotes the color of the -th light bulb.", "output": "For each test case, print one integer — the minimum number of operations to turn all the light bulbs on. If it is impossible to turn all the bulbs on, print .", "tutorial": "Note that there are only a few configuration classes: , , ,  and . Let's discuss each of them.If all  bulbs are of the same color, then it is impossible to turn all the bulbs on, because after you switch one light bulb, it is impossible to turn the others on.If there is a color with  bulbs, then it is impossible to turn all the bulbs on in  operations, which means there is a bulb that turns on, turns off and then turns on again, i.e. the answer is at least  operations. And there is a sequence of exactly  operations (such an example was shown in the problem notes).For configurations like  and , it is enough to turn on the  color bulbs not in a row (i.e. in order  for the first case and  for the second one). So the answer for such configurations is .If all the bulbs are of different colors, then nothing prevents you from turning them all on in  operations.", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nint main() {\n  ios::sync_with_stdio(false); cin.tie(0);\n  int tc;\n  cin >> tc;\n  while (tc--) {\n    string s;\n    cin >> s;\n    vector<int> cnt(10);\n    for (auto c : s) ++cnt[c - '0'];\n    int mx = *max_element(cnt.begin(), cnt.end());\n    if (mx == 4) cout << -1;\n    else if (mx == 3) cout << 6;\n    else cout << 4;\n    cout << '\\n';\n  }\n}", "interactive": false, "noSolution": false, "noTutorial": false}