{"link": "https://codeforces.com//contest/1260/problem/A", "problemId": "482533", "shortId": "1260A", "contest_number": "1260", "name": "A. Heating", "statement": "Several days ago you bought a new house and now you are planning to start a renovation. Since winters in your region can be very cold you need to decide how to heat rooms in your house.Your house has  rooms. In the -th room you can install at most  heating radiators. Each radiator can have several sections, but the cost of the radiator with  sections is equal to  burles.Since rooms can have different sizes, you calculated that you need at least  sections in total in the -th room. For each room calculate the minimum cost to install at most  radiators with total number of sections not less than .", "input": "The first line contains single integer  () — the number of rooms. Each of the next  lines contains the description of some room. The -th line contains two integers  and  () — the maximum number of radiators and the minimum total number of sections in the -th room, respectively.", "output": "For each room print one integer — the minimum possible cost to install at most  radiators with total number of sections not less than .", "tutorial": "Let's denote the number of sections in the -th radiator as . Let's prove that in the optimal answer . Proof by contradiction: suppose we have  and  in the answer, let's move  from  to  and check:  The answer is not optimal — contradiction.Finally, there is the only way to take  with . And it's to take  elements with value  and  elements with .", "solution": "#include<bits/stdc++.h>\nusing namespace std;\n\nint c, sum;\n\ninline bool read() {\n\tif(!(cin >> c >> sum))\n\t\treturn false;\n\treturn true;\n}\n\ninline void solve() {\n\tint d = sum / c;\n\tint rem = sum % c;\n\tcout << rem * (d + 1) * (d + 1) + (c - rem) * d * d << endl;\n}\n\nint main() {\n#ifdef _DEBUG\n\tfreopen(\"input.txt\", \"r\", stdin);\n#endif\n\tint n; cin >> n;\n\twhile(n--) {\n\t\tread();\n\t\tsolve();\n\t}\n\treturn 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}