{"link": "https://codeforces.com//contest/1437/problem/A", "problemId": "775839", "shortId": "1437A", "contest_number": "1437", "name": "A. Marketing Scheme", "statement": "You got a job as a marketer in a pet shop, and your current task is to boost sales of cat food. One of the strategies is to sell cans of food in packs with discounts. Suppose you decided to sell packs with  cans in a pack with a discount and some customer wants to buy  cans of cat food. Then he follows a greedy strategy:   he buys  packs with a discount;  then he wants to buy the remaining  cans one by one. But customers are greedy in general, so if the customer wants to buy  cans one by one and it happens that  he decides to buy the whole pack of  cans (instead of buying  cans). It makes you, as a marketer, happy since the customer bought more than he wanted initially.You know that each of the customers that come to your shop can buy any number of cans from  to  inclusive. Can you choose such size of pack  that each customer buys more cans than they wanted initially?", "input": "The first line contains a single integer  () — the number of test cases. The first and only line of each test case contains two integers  and  () — the range of the number of cans customers can buy.", "output": "For each test case, print  if you can choose such size of pack  that each customer buys more cans than they wanted initially. Otherwise, print . You can print each character in any case.", "tutorial": "Note that if  then exists such  that  and, obviously, a customer, who wants to buy  cans won't buy more than he wants.That's why  and we can rephrase our task as finding such  that . The longer the segment  is the better and the maximum we can take is . As a result, we need to check that .", "solution": "fun main() {\n    repeat(readLine()!!.toInt()) {\n        val (l, r) = readLine()!!.split(' ').map { it.toInt() }\n        println(if (2 * l > r) \"YES\" else \"NO\");\n    }\n}", "interactive": false, "noSolution": false, "noTutorial": false}