{"link": "https://codeforces.com//contest/1279/problem/A", "problemId": "504273", "shortId": "1279A", "contest_number": "1279", "name": "A. New Year Garland", "statement": "Polycarp is sad — New Year is coming in few days but there is still no snow in his city. To bring himself New Year mood, he decided to decorate his house with some garlands.The local store introduced a new service this year, called \"Build your own garland\". So you can buy some red, green and blue lamps, provide them and the store workers will solder a single garland of them. The resulting garland will have all the lamps you provided put in a line. Moreover, no pair of lamps of the same color will be adjacent to each other in this garland!For example, if you provide  red,  green and  blue lamps, the resulting garland can look like this: \"\" (\"\" being the red, green and blue color, respectively). Note that it's ok to have lamps of the same color on the ends of the garland.However, if you provide, say,  red,  green and  blue lamps then the store workers won't be able to build any garland of them. Any garland consisting of these lamps will have at least one pair of lamps of the same color adjacent to each other. Note that the store workers should use all the lamps you provided.So Polycarp has bought some sets of lamps and now he wants to know if the store workers can build a garland from each of them.", "input": "The first line contains a single integer  () — the number of sets of lamps Polycarp has bought. Each of the next  lines contains three integers ,  and  () — the number of red, green and blue lamps in the set, respectively.", "output": "Print  lines — for each set of lamps print \"\" if the store workers can build a garland from them and \"\" otherwise.", "tutorial": "Let $$$r \\le g \\le b$$$ (if it is not the case, do some swaps). If $$$b > r + g + 1$$$, then at least two blue lamps will be adjacent — so there is no solution.Otherwise the answer can be easily constucted. Place all blue lamps in a row. Then place red lamps: one between the first and the second blue lamp, one between the second and the third, and so on. Then place all green lamps: one between the $$$(b-1)$$$-th blue lamp and the $$$b$$$-th, one between the blue lamps with numbers $$$(b - 2)$$$ and $$$(b - 1)$$$, and so on. Since $$$r + g \\ge b - 1$$$, there is at least one non-blue lamp between each pair of blue lamps. If $$$g = b$$$, we didn't place all green lamps, we can place the remaining one before all other lamps (the same with $$$r = b$$$).So, if we swap $$$l$$$, $$$g$$$ and $$$b$$$ in such a way that $$$r \\le g \\le b$$$, we only have to check that $$$b \\le r + g + 1$$$.", "solution": "for t in range(int(input())):\n\ta = sorted(list(map(int, input().split())))\n\tprint('Yes' if a[2] <= a[0] + a[1] + 1 else 'No')", "interactive": false, "noSolution": false, "noTutorial": false}