{"link": "https://codeforces.com//contest/1651/problem/A", "problemId": "1324096", "shortId": "1651A", "contest_number": "1651", "name": "A. Playoff", "statement": "Consider a playoff tournament where  athletes compete. The athletes are numbered from  to .The tournament is held in  stages. In each stage, the athletes are split into pairs in such a way that each athlete belongs exactly to one pair. In each pair, the athletes compete against each other, and exactly one of them wins. The winner of each pair advances to the next stage, the athlete who was defeated gets eliminated from the tournament.The pairs are formed as follows:  in the first stage, athlete  competes against athlete ;  competes against ;  competes against , and so on;  in the second stage, the winner of the match \"–\" competes against the winner of the match \"–\"; the winner of the match \"–\" competes against the winner of the match \"–\", and so on;  the next stages are held according to the same rules. When athletes  and  compete, the winner is decided as follows:  if  is odd, the athlete with the lower index wins (i. e. if , then  wins, otherwise  wins);  if  is even, the athlete with the higher index wins. The following picture describes the way the tournament with  goes.  Your task is the following one: given the integer , determine the index of the athlete who wins the tournament.", "input": "The first line contains one integer  () — the number of test cases. Each test case consists of one line containing one integer  ().", "output": "For each test case, print one integer — the index of the winner of the tournament.", "tutorial": "During the first stage, every player with an even index competes against a player with an odd index, so in each match during the first stage, the player whose index is smaller wins. The pairs are formed in such a way that, in each pair, the player with an odd index has smaller index, so all players with even indices get eliminated, and all players with odd indices advance to the next stage.All of the remaining matches are between players with odd indices, so the winner of each match is the player with the larger index. So, the overall winner of the tournament is the player with the greatest odd index, which is .Note: in some languages (for example, C++), standard power functions work with floating-point numbers instead of integers, so they will produce the answer as a floating-point number (which may lead to wrong formatting of the output and/or calculation errors). You might have to implement your own power function that works with integers, or compute  using a loop.", "solution": "t = int(input())\nfor i in range(t):\n    n = int(input())\n    print(2 ** n - 1)", "interactive": false, "noSolution": false, "noTutorial": false}