{"link": "https://codeforces.com//contest/1555/problem/A", "problemId": "1062140", "shortId": "1555A", "contest_number": "1555", "name": "A. PizzaForces", "statement": "PizzaForces is Petya's favorite pizzeria. PizzaForces makes and sells pizzas of three sizes: small pizzas consist of  slices, medium ones consist of  slices, and large pizzas consist of  slices each. Baking them takes ,  and  minutes, respectively.Petya's birthday is today, and  of his friends will come, so he decided to make an order from his favorite pizzeria. Petya wants to order so much pizza that each of his friends gets at least one slice of pizza. The cooking time of the order is the total baking time of all the pizzas in the order.Your task is to determine the minimum number of minutes that is needed to make pizzas containing at least  slices in total. For example:   if  friends come to Petya's birthday, he has to order pizzas containing at least  slices in total. He can order two small pizzas, containing exactly  slices, and the time to bake them is  minutes;  if  friends come to Petya's birthday, he has to order pizzas containing at least  slices in total. He can order a small pizza and a large pizza, containing  slices, and the time to bake them is  minutes;  if  friends come to Petya's birthday, he has to order pizzas containing at least  slices in total. He can order  small pizzas,  medium pizzas and  large pizzas, in total they contain  slices, and the total time to bake them is  minutes;  if only one friend comes to Petya's birthday, he can order a small pizza, and the time to bake it is  minutes. ", "input": "The first line contains a single integer  () — the number of testcases. Each testcase consists of a single line that contains a single integer  () — the number of Petya's friends.", "output": "For each testcase, print one integer — the minimum number of minutes that is needed to bake pizzas containing at least  slices in total.", "tutorial": "Note that the \"speed\" of cooking $$$1$$$ slice of pizza is the same for all sizes — $$$1$$$ slice of pizza for $$$2.5$$$ minutes.If $$$n$$$ is odd, then we will increase it by $$$1$$$ (since the pizza is cooked only with an even number of pieces). Now the value of $$$n$$$ is always even. If $$$n < 6$$$, then for such $$$n$$$ the answer is equal to the answer for $$$n=6$$$, so we can say that $$$n = \\max(n, 6)$$$. While $$$n \\ge 12$$$ we can order a small pizza. Eventually the value of $$$n$$$ will be equal to $$$6$$$, $$$8$$$ or $$$10$$$. This means that for any $$$n$$$ there will be a set of pizzas with exactly $$$n$$$ slices. Then the answer is $$$n * 2.5$$$ (in the solution, it is better to use the formula $$$n / 2 * 5$$$).", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nint main() {\n  int t;\n  cin >> t;\n  while (t--) {\n    long long n;\n    cin >> n;\n    cout << max(6LL, n + 1) / 2 * 5 << '\\n';\n  }\n}", "interactive": false, "noSolution": false, "noTutorial": false}