{"link": "https://codeforces.com//contest/1709/problem/A", "problemId": "1473244", "shortId": "1709A", "contest_number": "1709", "name": "A. Three Doors", "statement": "There are three doors in front of you, numbered from  to  from left to right. Each door has a lock on it, which can only be opened with a key with the same number on it as the number on the door.There are three keys — one for each door. Two of them are hidden behind the doors, so that there is no more than one key behind each door. So two doors have one key behind them, one door doesn't have a key behind it. To obtain a key hidden behind a door, you should first unlock that door. The remaining key is in your hands.Can you open all the doors?", "input": "The first line contains a single integer  () — the number of testcases. The first line of each testcase contains a single integer  () — the number on the key in your hands. The second line contains three integers  and  () — the number on the key behind each of the doors. If there is no key behind the door, the number is equal to . Values  and  appear exactly once among  and .", "output": "For each testcase, print \"\" if you can open all the doors. Otherwise, print \"\".", "tutorial": "Note that we never have a choice in what door should we open. First, we open the door with the same number as the key in our hand. Then, the door with the same number as the key behind the first opened door. Finally, the door with the same number as the key behind the second opened door.If any of the first and second opened doors didn't have a key behind it, then it's impossible. Otherwise, we open every door.Let  be the keys behind the corresponding doors. Then we should check if  is not zero and  is not zero.Overall complexity:  per testcase.", "solution": "for _ in range(int(input())):\n\tx = int(input())\n\ta = [0] + [int(x) for x in input().split()]\n\tprint(\"YES\" if a[x] != 0 and a[a[x]] != 0 else \"NO\")", "interactive": false, "noSolution": false, "noTutorial": false}