{"link": "https://codeforces.com//contest/1207/problem/A", "problemId": "393971", "shortId": "1207A", "contest_number": "1207", "name": "A. There Are Two Types Of Burgers", "statement": "There are two types of burgers in your restaurant — hamburgers and chicken burgers! To assemble a hamburger you need two buns and a beef patty. To assemble a chicken burger you need two buns and a chicken cutlet. You have  buns,  beef patties and  chicken cutlets in your restaurant. You can sell one hamburger for  dollars and one chicken burger for  dollars. Calculate the maximum profit you can achieve.You have to answer  independent queries.", "input": "The first line contains one integer  () – the number of queries. The first line of each query contains three integers ,  and  () — the number of buns, beef patties and chicken cutlets in your restaurant. The second line of each query contains two integers  and  () — the hamburger and chicken burger prices in your restaurant.", "output": "For each query print one integer — the maximum profit you can achieve.", "tutorial": "In this task you just can iterate over the numbers of hamburgers and chicken burgers you want to assemble, check that you have enough ingredients and update the answer.If you want to sell  hamburgers and  chicken burgers then you need  beef patties,  chicken cutlets and  buns.", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nint t;\nint b, p, f;\nint h, c;\n\nint main() {\n    cin >> t;\n    for(int tc = 0; tc < t; ++tc){\n        cin >> b >> p >> f;\n        cin >> h >> c;\n\n        b /= 2;\n        if(h < c){\n            swap(h, c);\n            swap(p, f);\n        }\n\n        int res = 0;\n\n        int cnt = min(b, p);\n        b -= cnt, p -= cnt;\n        res += h * cnt; \n        \n        cnt = min(b, f);\n        b -= cnt, f -= cnt;\n        res += c * cnt; \n            \n        cout << res << endl;\n    }\n    return 0;\n}                               ", "interactive": false, "noSolution": false, "noTutorial": false}