{"link": "https://codeforces.com//contest/1671/problem/B", "problemId": "1376216", "shortId": "1671B", "contest_number": "1671", "name": "B. Consecutive Points Segment", "statement": "You are given  points with integer coordinates on a coordinate axis . The coordinate of the -th point is . All points' coordinates are distinct and given in strictly increasing order.For each point , you can do the following operation : take this point and move it by  to the left or to the right (i..e., you can change its coordinate  to  or to ). In other words, for each point, you choose (separately) its new coordinate. For the -th point, it can be either ,  or .Your task is to determine if you can move some points as described above in such a way that the new set of points forms a  of integers, i. e. for some integer  the coordinates of points should be equal to .Note that the resulting points should have  coordinates.You have to answer  independent test cases.", "input": "The first line of the input contains one integer  () — the number of test cases. Then  test cases follow. The first line of the test case contains one integer  () — the number of points in the set . The second line of the test case contains  integers  (), where  is the coordinate of the -th point. It is guaranteed that the points are given in strictly increasing order (this also means that all coordinates are distinct). It is also guaranteed that the sum of  does not exceed  ().", "output": "For each test case, print the answer — if the set of points from the test case can be moved to form a consecutive segment of integers, print , otherwise print .", "tutorial": "We can see that the answer is  if and only if there are no more than two gaps of length  between the given points. If there is no gap, the answer is obviously . If there is only one gap of length , we can just move the left (or the right) part of the set to this gap. When there are two gaps, we can move the part before the first gap to the right and the part after the second gap to the left. Of course, if there is a gap of length at least  (or multiple gaps with the total length ), we can't move the points from the left and the right part to satisfy the middle gap.Time complexity: .", "solution": "for i in range(int(input())):\n    n = int(input())\n    x = list(map(int, input().split()))\n    print('YES' if x[-1] - x[0] - n + 1 <= 2 else 'NO')", "interactive": false, "noSolution": false, "noTutorial": false}