{"link": "https://codeforces.com//contest/1132/problem/B", "problemId": "307696", "shortId": "1132B", "contest_number": "1132", "name": "B. Discounts", "statement": "You came to a local shop and want to buy some chocolate bars. There are  bars in the shop, -th of them costs  coins (and you want to buy all of them).You have  different coupons that allow you to buy chocolate bars. -th coupon allows you to buy  chocolate bars while you have to pay only for the  most expensive ones (so, the cheapest bar of those  bars is for free).You can use only one coupon; if you use coupon , you have to choose  bars and buy them using the coupon, and buy all the remaining  bars without any discounts.To decide which coupon to choose, you want to know what will be the minimum total amount of money you have to pay if you use one of the coupons optimally.", "input": "The first line contains one integer  () — the number of chocolate bars in the shop. The second line contains  integers , , ...,  (), where  is the cost of -th chocolate bar. The third line contains one integer  () — the number of coupons you have. The fourth line contains  integers , , ...,  (), where  is the number of chocolate bars you have to buy using -th coupon so that the least expensive of them will be for free. .", "output": "Print  integers, -th of them should be the minimum amount of money you have to pay if you buy  bars with -th coupon, and all the remaining bars one by one for their full price.", "tutorial": "When using -th coupon, the bar we get for free should have at least  bars not cheaper than it. So, if we consider  sorted in non-decreasing order, then we cannot get discount greater than .On the other hand, we can always get such a discount if we pick  most expensive bars to buy using the -th coupon.", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nconst int N = 300009;\n\nint n;\nint a[N];\nlong long res[N];\n\nint main() {\n\tlong long sum = 0;\n\tscanf(\"%d\", &n);\t\n\tfor(int i = 0; i < n; ++i){\n\t\tscanf(\"%d\", a + i);\n\t\tsum += a[i];\t\n\t}\n\tsort(a, a + n);\n\t\n\tmemset(res, -1, sizeof res);\n\tint m;\n\tscanf(\"%d\", &m);\n\tfor(int i = 0; i < m; ++i){\n\t\tint c;\n\t\tscanf(\"%d\", &c);\n\t\tif(res[c] == -1){\n\t\t\tres[c] = sum - a[n - c];\n\t\t}\t\n\n\t\tprintf(\"%lld\\n\", res[c]);\n\t}\n\treturn 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}