{"link": "https://codeforces.com//contest/1749/problem/B", "problemId": "1596423", "shortId": "1749B", "contest_number": "1749", "name": "B. Death's Blessing", "statement": "You are playing a computer game. To pass the current level, you have to kill a big horde of monsters. In this horde, there are  monsters standing in the row, numbered from  to . The -th monster has  health and a special \"Death's Blessing\" spell of strength  attached to it.You are going to kill all of them . It takes exactly  seconds to kill a monster with health .When the -th monster dies, it casts its spell that increases the health of its  by  (the neighbors of the -th monster in the row are the monsters on places  and . The first and the last monsters have only one neighbor each).After each monster is killed, the row shrinks, so its former neighbors become adjacent to each other (so if one of them dies, the other one is affected by its spell). For example, imagine a situation with  monsters with health  and spells . One of the ways to get rid of the monsters is shown below:    As a result, we can kill all monsters in    seconds. Note that it's only an example and may not be the fastest way to get rid of the monsters.What is the minimum time required to kill all monsters in the row?", "input": "The first line contains a single integer  () — the number of test cases. The first line of each test case contains a single integer  () — the number of monsters in the row. The second line contains  integers  () — the initial health of corresponding monsters. The third line contains  integers  (), where  is the strength of the spell for the -th monster. It's guaranteed that the sum of  doesn't exceed .", "output": "For each test case, print one integer — the minimum possible total time to kill all monsters.", "tutorial": "Note that whichever order you choose, the total time will always contain all initial health , in other words, any answer will contain  as its part. So the lower the sum of  you will add to the answer — the better.Look at some monster . If you kill it while it has both left and right neighbor, it will add  to the answer. If it is the first or the last in the row, it will add just . And if it is the last monster, it will add .There can be only one last monster, so any other will add at least  to the answer. And for any chosen last monster  you can find the order that gives exactly  for all other monsters. For example, you can firstly kill monsters , then  and, finally, moster .In other words, if the last monster is the -th one, the total answer will be equal to . Since we need to minimize answer, we can choose monster with maximum .So, the answer is .", "solution": "fun main() {\n    repeat(readLine()!!.toInt()) {\n        val n = readLine()!!.toInt()\n        val a = readLine()!!.split(' ').map { it.toLong() }\n        val b = readLine()!!.split(' ').map { it.toLong() }\n\n        println(a.sum() + b.sum() - b.maxOrNull()!!)\n    }\n}", "interactive": false, "noSolution": false, "noTutorial": false}