{"link": "https://codeforces.com//contest/1721/problem/B", "problemId": "1521725", "shortId": "1721B", "contest_number": "1721", "name": "B. Deadly Laser", "statement": "The robot is placed in the top left corner of a grid, consisting of  rows and  columns, in a cell .In one step, it can move into a cell, adjacent by a side to the current one:   ;  ;  ;  . The robot can't move outside the grid.The cell  contains a deadly laser. If the robot comes into some cell that has distance less than or equal to  to the laser, it gets evaporated. The distance between two cells  and  is .Print the smallest number of steps that the robot can take to reach the cell  without getting evaporated or moving outside the grid. If it's not possible to reach the cell , print .The laser is neither in the starting cell, nor in the ending cell. The starting cell always has distance greater than  to the laser.", "input": "The first line contains a single integer  () — the number of testcases. The only line of each testcase contains five integers  (; ; ; ) — the size of the grid, the cell that contains the laser and the evaporating distance of the laser. The laser is neither in the starting cell, nor in the ending cell ( and ). The starting cell  always has distance greater than  to the laser ().", "output": "For each testcase, print a single integer. If it's possible to reach the cell  from  without getting evaporated or moving outside the grid, then print the smallest amount of steps it can take the robot to reach it. Otherwise, print .", "tutorial": "First, let's determine if it's possible to reach the end at all. If the laser's field doesn't span until any wall, then it's surely possible — just stick to the wall yourself.If it touches at most one wall, it's still possible. If it's the bottom wall or the left wall, then take the path close to the top and the right wall. Vice versa, if it's the top wall or the right wall, then take the path close to the bottom and the left wall.What if both of these paths are locked? That means that the laser touches at least two walls at the same time: the top one and the left one, or the bottom one and the right one. Turns out, it's completely impossible to reach the end in either of these two cases. Just draw a picture and see for yourself.Thus, we can always take at least one of the path sticking to the walls. The distance from the start to the end is , and both of these paths are exactly this long. So the answer is always either  or .To check if the laser touches a wall with its field, you can either use a formula or check every cell adjacent to a wall.Overall complexity:  or  per testcase.", "solution": "for _ in range(int(input())):\n\tn, m, sx, sy, d = map(int, input().split())\n\tif min(sx - 1, m - sy) <= d and min(n - sx, sy - 1) <= d:\n\t    print(-1)\n\telse:\n\t    print(n + m - 2)", "interactive": false, "noSolution": false, "noTutorial": false}