{"link": "https://codeforces.com//contest/1036/problem/B", "problemId": "216418", "shortId": "1036B", "contest_number": "1036", "name": "B. Diagonal Walking v.2", "statement": "Mikhail walks on a Cartesian plane. He starts at the point , and in one move he can go to any of eight adjacent points. For example, if Mikhail is currently at the point , he can go to any of the following points in one move:   ;  ;  ;  ;  ;  ;  ;  . If Mikhail goes from the point  to the point  in one move, and  and , then such a move is called a .Mikhail has  . For the -th query Mikhail's target is to go to the point  from the point  in   moves. Among all possible movements he want to choose one with the maximum number of . Your task is to find the maximum number of  or find that it is impossible to go from the point  to the point  in  moves.Note that Mikhail  visit any point any number of times (even the destination point!).", "input": "The first line of the input contains one integer  () — the number of queries. Then  lines follow. The -th of these  lines contains three integers ,  and  () — -coordinate of the destination point of the query, -coordinate of the destination point of the query and the number of moves in the query, correspondingly.", "output": "Print  integers. The -th integer should be equal to  if Mikhail cannot go from the point  to the point  in   moves described above. Otherwise the -th integer should be equal to the the maximum number of  among all possible movements.", "tutorial": "There are several cases in this problem. If  then let's swap them. Let  be the modulo operator. Firstly, if  then let's decrease  and  by one. Otherwise if  let's decrease ,  by one and  by two. Now if  then the answer is , otherwise the answer is . You can get more clear description of these cases if you will draw some cases on the paper.", "solution": "q = int(input())\n\nfor i in range(q):\n    n, m, k = map(int, input().split())\n    if (n < m): n, m = m, n\n    if (n % 2 != m % 2):\n        k -= 1\n        n -= 1\n    elif (n % 2 != k % 2):\n        k -= 2\n        n -= 1\n        m -= 1\n    print(-1 if k < n else k)", "interactive": false, "noSolution": false, "noTutorial": false}