{"link": "https://codeforces.com//contest/612/problem/B", "problemId": "43950", "shortId": "612B", "contest_number": "612", "name": "B. HDD is Outdated Technology", "statement": "HDD hard drives group data by sectors. All files are split to fragments and each of them are written in some sector of hard drive. Note the fragments can be written in sectors in arbitrary order.One of the problems of HDD hard drives is the following: the magnetic head should move from one sector to another to read some file.Find the time need to read file split to  fragments. The -th sector contains the -th fragment of the file (). Note different sectors contains the different fragments. At the start the magnetic head is in the position that contains the first fragment. The file are reading in the following manner: at first the first fragment is read, then the magnetic head moves to the sector that contains the second fragment, then the second fragment is read and so on until the -th fragment is read. The fragments are read in the order from the first to the -th.It takes  time units to move the magnetic head from the sector  to the sector . Reading a fragment takes no time.", "input": "The first line contains a positive integer  () — the number of fragments. The second line contains  different integers  () — the number of the fragment written in the -th sector.", "output": "Print the only integer — the number of time units needed to read the file.", "tutorial": "You are given the permutation f. Let's build another permutation p in the following way: pfi = i. So the permutation p defines the number of sector by the number of fragment. The permutation p is called inverse permutation to f and denoted f - 1. Now the answer to problem is .\nComplexity: O(n).\n", "solution": "/*\nSent to the islands to secure what is ours\nMarching ashore in the cover of night\nHide until dawn and attack in the twilight\nShake them awake with the thunder of guns\n\nOrders from the iron maiden, get the islands back\nFailure will not be accepted, call for artillery strike, launch attack\n\nWe are Back in control, force them to surrender\nTake what is ours, restore law and order\nBack in control, push them further out to sea\nFalklands in our hands, back under British reign\n\nPush them back further and out from the islands\nInto our fleet that will stop their retreat\nMark their positions and call in the airforce\nHarriers and Vulcans strikes at our command\n*/\n\n//#pragma comment(linker, \"/STACK:16777216\")\n#define _CRT_SECURE_NO_WARNINGS\n#include <fstream>\n#include <iostream>\n#include <string>\n#include <complex>\n#include <math.h>\n#include <set>\n#include <vector>\n#include <map>  \n#include <queue>\n#include <stdio.h>\n#include <stack>\n#include <algorithm>\n#include <list>\n#include <ctime>\n#include <memory.h>\n#include <ctime> \n#include <assert.h>\n\n#define y0 sdkfaslhagaklsldk\n#define y1 aasdfasdfasdf\n#define yn askfhwqriuperikldjk\n#define j1 assdgsdgasghsf\n#define tm sdfjahlfasfh\n#define lr asgasgash\n\n#define eps 1e-8\n#define M_PI 3.141592653589793\n#define bs 1000000007\n#define bsize 512\n\nconst int N = 210000;\n\nusing namespace std;\n\nlong long ans;\nint ps[N];\nint n;\n\nint main(){\n\t//freopen(\"beavers.in\",\"r\",stdin);\n\t//freopen(\"beavers.out\",\"w\",stdout);\n\t//freopen(\"F:/in.txt\",\"r\",stdin);\n\t//freopen(\"F:/output.txt\",\"w\",stdout);\n\tios_base::sync_with_stdio(0);\n\t//cin.tie(0);\n\t\n\tcin >> n;\n\tfor (int i = 1; i <= n; i++)\n\t{\n\t\tint val;\n\t\tcin >> val;\n\t\tps[val] = i;\n\t}\n\tfor (int i = 2; i <= n; i++)\n\t{\n\t\tans += abs(ps[i] - ps[i - 1]);\n\t}\n\tcout << ans << endl;\n\n\tcin.get(); cin.get();\n\treturn 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}