{"link": "https://codeforces.com//contest/1257/problem/B", "problemId": "470637", "shortId": "1257B", "contest_number": "1257", "name": "B. Magic Stick", "statement": "Recently Petya walked in the forest and found a magic stick.Since Petya really likes numbers, the first thing he learned was spells for changing numbers. So far, he knows only two spells that can be applied to a  integer:   If the chosen number  is even, then the spell will turn it into ;  If the chosen number  is greater than one, then the spell will turn it into . Note that if the number is even and greater than one, then Petya can choose which spell to apply.Petya now has only one number . He wants to know if his favorite number  can be obtained from  using the spells he knows. The spells can be used any number of times in any order. It is not required to use spells, Petya can leave  as it is.", "input": "The first line contains single integer  () — the number of test cases. Each test case consists of two lines. The first line of each test case contains two integers  and  () — the current number and the number that Petya wants to get.", "output": "For the -th test case print the answer on it —  if Petya can get the number  from the number  using known spells, and  otherwise. You may print every letter in any case you want (so, for example, the strings , ,  and  will all be recognized as positive answer).", "tutorial": " cannot be transformed into any other number.  can be transformed into  or , and  can be transformed only into . It means that if , then only  is reachable; and if  or , then  should be less than .Otherwise, we can make  as large as we want, so if , any  is reachable.", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nvoid solve() {\n\tint x, y;\n\tcin >> x >> y;\n\t\n\tif (x > 3) puts(\"YES\");\n\telse if (x == 1) puts(y == 1 ? \"YES\" : \"NO\");\n\telse puts(y <= 3 ? \"YES\" : \"NO\");\n}\n\nint main() {\n\tint tc;\n\tcin >> tc;\n\twhile (tc--) solve();\n}", "interactive": false, "noSolution": false, "noTutorial": false}