{"link": "https://codeforces.com//contest/1633/problem/B", "problemId": "1280034", "shortId": "1633B", "contest_number": "1633", "name": "B. Minority", "statement": "You are given a string , consisting only of characters '0' and '1'.You have to choose a contiguous substring of  and remove all occurrences of the character, which is a strict minority in it, from the substring.That is, if the amount of '0's in the substring is strictly smaller than the amount of '1's, remove all occurrences of '0' from the substring. If the amount of '1's is strictly smaller than the amount of '0's, remove all occurrences of '1'. If the amounts are the same, do nothing.You have to apply the operation . What is the maximum amount of characters that can be removed?", "input": "The first line contains a single integer  () — the number of testcases. The only line of each testcase contains a non-empty string , consisting only of characters '0' and '1'. The length of  doesn't exceed . The total length of strings  over all testcases doesn't exceed .", "output": "For each testcase, print a single integer — the maximum amount of characters that can be removed after applying the operation .", "tutorial": "Let's try to estimate the maximum possible answer. Best case, you will be able to remove either all zeros or all ones from the entire string. Whichever has the least occurrences, can be the answer.If the amounts of zeros and ones in the string are different, this bound is actually easy to reach: just choose the substring that is the entire string.If the amounts are the same, the bound is impossible to reach. Choosing the entire string will do nothing, and asking a smaller substring will decrease the answer.The smallest we can decrease the answer by is . If you choose the substring that is the string without the last character, you will decrease one of the amounts by one. That will make the amounts different, and the bound will be reached.Overall complexity:  per testcase.", "solution": "for _ in range(int(input())):\n    s = input()\n    print(min((len(s) - 1) // 2, s.count('0'), s.count('1')))", "interactive": false, "noSolution": false, "noTutorial": false}