{"link": "https://codeforces.com//contest/1766/problem/B", "problemId": "1690147", "shortId": "1766B", "contest_number": "1766", "name": "B. Notepad ", "statement": "You want to type the string , consisting of  lowercase Latin letters, using your favorite text editor Notepad#.Notepad# supports two kinds of operations:   append any letter  of the string;  copy a  substring of an already typed string and paste this substring  of the string. Can you type string  in  than  operations?", "input": "The first line contains a single integer  () — the number of testcases. The first line of each testcase contains a single integer  () — the length of the string . The second line contains a string , consisting of  lowercase Latin letters. The sum of  doesn't exceed  over all testcases.", "output": "For each testcase, print \"\" if you can type string  in  than  operations. Otherwise, print \"\".", "tutorial": "Why does the problem ask us only to check if we can do less than  operations instead of just asking the minimum amount? That must be making the problem easier, so let's focus our attention on that.What if it was  instead of ? Well, then the problem would be trivial. You can type the word letter by letter and be done in  operations. So we only have to save one operation. In order to save at least one operation, we have to use the copy operation and copy more than one character in that.Let's take a closer look at any of the copy operations we do. Basically, it has to be a substring that has at least two non-intersection occurrences in the string. Thus, if the string has any substring that has length at least two that appears at least twice in the string, we can copy it, and the answer will be \"\".That's still not enough to solve the problem — we'd have to check all substrings, which is .Let's think further. Imagine we found a substring that works. Let it have length . Notice how you can remove its last character, obtaining a substring of length , and it will still occure in the same set of positions (possibly, even more occurrences will be found). Remove characters until the substring has length . Thus, if any appropriate substring exists, an appropriate substring of length  also exists.Finally, we can check if there exists a substring of length  that appears at least twice in the string so that the occurrences are at least  apart. That can be done with a set/hashset or a map/hashmap. Some implementations might require careful handling of the substrings of kind \"\", \"\" and similar.Overall complexity:  or  per testcase.", "solution": "for _ in range(int(input())):\n\tn = int(input())\n\ts = input()\n\tcur = {}\n\tfor i in range(n - 1):\n\t\tt = s[i:i+2]\n\t\tif t in cur:\n\t\t\tif cur[t] < i - 1:\n\t\t\t\tprint(\"YES\")\n\t\t\t\tbreak\n\t\telse:\n\t\t\tcur[t] = i\n\telse:\n\t\tprint(\"NO\")", "interactive": false, "noSolution": false, "noTutorial": false}