{"link": "https://codeforces.com//contest/954/problem/B", "problemId": "167339", "shortId": "954B", "contest_number": "954", "name": "B. String Typing", "statement": "You are given a string  consisting of  lowercase Latin letters. You have to type this string using your keyboard.Initially, you have an empty string. Until you type the whole string, you may perform the following operation:  add a character to the end of the string. Besides,  you may perform one additional operation: copy the string and append it to itself.For example, if you have to type string , you can type it in  operations if you type all the characters one by one. However, you can type it in  operations if you type the string  first and then copy it and type the last character.If you have to type string , the best option is to type  characters one by one, then copy the string, and then type the remaining character.Print the minimum number of operations you need to type the given string.", "input": "The first line of the input containing only one integer number  () — the length of the string you have to type. The second line containing the string  consisting of  lowercase Latin letters.", "output": "Print one integer number — the minimum number of operations you need to type the given string.", "tutorial": "Let's consider  as a substring of string  from position  to position  ( is not included). Let's iterate over all lenghts of the copied prefix from  to 0 inclusive, and then if  then answer will be  and iterating over smaller lenghts is not necessary.", "solution": "#include<bits/stdc++.h>\n#define MN 105\nusing namespace std;\ninline int read()\n{\n    int x=0,f=1;char ch=getchar();\n    while(ch<'0'||ch>'9'){if(ch=='-')f=-1;ch=getchar();}\n    while(ch>='0'&&ch<='9'){x=x*10+ch-'0';ch=getchar();}\n    return x*f;\n}\nchar c[MN];\nint n;\nint main()\n{\n\tregister int i,j;\n\tn=read();\n\tscanf(\"%s\",c+1);\n\tfor (i=n/2;i;--i)\n\t{\n\t\tfor (j=1;j<=i;++j)\n\t\t\tif (c[j]!=c[i+j]) break;\n\t\tif (j>i) break;\n\t}\n\tif (i) printf(\"%d\",n-i+1); else printf(\"%d\",n);\n}", "interactive": false, "noSolution": false, "noTutorial": false}