{"link": "https://codeforces.com//contest/1792/problem/B", "problemId": "1749560", "shortId": "1792B", "contest_number": "1792", "name": "B. Stand-up Comedian", "statement": "Eve is a beginner stand-up comedian. Her first show gathered a grand total of two spectators: Alice and Bob.Eve prepared  jokes to tell, grouped by their type:   type 1: both Alice and Bob like them;  type 2: Alice likes them, but Bob doesn't;  type 3: Bob likes them, but Alice doesn't;  type 4: neither Alice nor Bob likes them. Initially, both spectators have their mood equal to . When a spectator hears a joke he/she likes, his/her mood increases by . When a spectator hears a joke he/she doesn't like, his/her mood decreases by . If the mood of a spectator becomes negative (strictly below zero), he/she leaves.When someone leaves, Eve gets sad and ends the show. If no one leaves, and Eve is out of jokes, she also ends the show.Thus, Eve wants to arrange her jokes in such a way that the show lasts as long as possible. Help her to calculate the maximum number of jokes she can tell before the show ends.", "input": "The first line contains a single integer  () — the number of testcases. The only line of each testcase contains four integers  (; ) — the number of jokes of each type Eve prepared.", "output": "For each testcase, print a single integer — the maximum number of jokes Eve can tell before at least one of the spectators leaves or before she runs out of jokes.", "tutorial": "First, let Eve tell the jokes of the first type — they will never do any harm. At the same time, let her tell the jokes of the fourth time at the very end — they will not do any good.Types two and three are kind of opposites of each other. If you tell jokes of each of them one after another, then the moods of both spectators don't change. Let's use that to our advantage. Tell the jokes of these types in pairs until one of them runs out. There's a little corner case here, though. If there were no jokes of the first type, then you can't use a single pair because of the spectators leaves after one joke.Finally, try to tell the remaining jokes of the same type before the fourth type. So the construction looks like  with  and  possibly swapped with each other.Let's recover the answer from that construction. After the first type, both moods are . After the alternating jokes, the moods are still the same. After that, one of the spectators will have his/her mood only decreasing until the end. Once it reaches , the show ends.Thus, Eve can tell  jokes if . Otherwise, it's always .Overall complexity: .", "solution": "for _ in range(int(input())):\n    a1, a2, a3, a4 = map(int, input().split())\n    if a1 == 0:\n        print(1)\n    else:\n        print(a1 + min(a2, a3) * 2 + min(a1 + 1, abs(a2 - a3) + a4))", "interactive": false, "noSolution": false, "noTutorial": false}