{"link": "https://codeforces.com//contest/1620/problem/B", "problemId": "1233289", "shortId": "1620B", "contest_number": "1620", "name": "B. Triangles on a Rectangle", "statement": "A rectangle with its opposite corners in  and  and sides parallel to the axes is drawn on a plane.You are given a list of lattice points such that each point lies on a side of a rectangle but not in its corner. Also, there are at least two points on every side of a rectangle.Your task is to choose three points in such a way that:   exactly two of them belong to the same side of a rectangle;  the area of a triangle formed by them is maximum possible. Print the doubled area of this triangle. It can be shown that the doubled area of any triangle formed by lattice points is always an integer.", "input": "The first line contains a single integer  () — the number of testcases. The first line of each testcase contains two integers  and  () — the coordinates of the corner of a rectangle. The next two lines contain the description of the points on two horizontal sides. First, an integer  () — the number of points. Then,  integers  () — the  coordinates of the points in the ascending order. The  coordinate for the first line is  and for the second line is . The next two lines contain the description of the points on two vertical sides. First, an integer  () — the number of points. Then,  integers  () — the  coordinates of the points in the ascending order. The  coordinate for the first line is  and for the second line is . The total number of points on all sides in all testcases doesn't exceed .", "output": "For each testcase print a single integer — the doubled maximum area of a triangle formed by such three points that exactly two of them belong to the same side.", "tutorial": "The area of a triangle is equal to its base multiplied by its height divided by . Let the two points that have to be on the same side of a rectangle form its base. To maximize it, let's choose such two points that are the most apart from each other — the first and the last in the list.Then the height will be determined by the distance from that side to the remaining point. Since there are points on all sides, the points on the opposite side are the furthest. Thus, the height is always one of  or , depending on whether we picked the horizontal or the vertical side.So we have to check four options to pick the side and choose the best answer among them.", "solution": "for _ in range(int(input())):\n  w, h = map(int, input().split())\n  ans = 0\n  for i in range(4):\n    a = [int(x) for x in input().split()][1:]\n    ans = max(ans, (a[-1] - a[0]) * (h if i < 2 else w))\n  print(ans)", "interactive": false, "noSolution": false, "noTutorial": false}