{"link": "https://codeforces.com//contest/1279/problem/B", "problemId": "504274", "shortId": "1279B", "contest_number": "1279", "name": "B. Verse For Santa", "statement": "New Year is coming! Vasya has prepared a New Year's verse and wants to recite it in front of Santa Claus.Vasya's verse contains  parts. It takes  seconds to recite the -th part. Vasya can't change the order of parts in the verse: firstly he recites the part which takes  seconds, secondly — the part which takes  seconds, and so on. After reciting the verse, Vasya will get the number of presents equal to the number of parts he fully recited.Vasya can skip at most one part of the verse while reciting it (if he skips more than one part, then Santa will definitely notice it).Santa will listen to Vasya's verse for no more than  seconds. For example, if , , and Vasya skips the first part of verse, then he gets two presents.Note that it is possible to recite the whole verse (if there is enough time). Determine which part Vasya needs to skip to obtain the maximum possible number of gifts. If Vasya shouldn't skip anything, print . If there are multiple answers, print any of them.You have to process  test cases.", "input": "The first line contains one integer  () — the number of test cases. The first line of each test case contains two integers  and  () — the number of parts in the verse and the maximum number of seconds Santa will listen to Vasya, respectively. The second line of each test case contains  integers  () — the time it takes to recite each part of the verse. It is guaranteed that the sum of  over all test cases does not exceed .", "output": "For each test case print one integer — the number of the part that Vasya needs to skip to obtain the maximum number of gifts. If Vasya shouldn't skip any parts, print .", "tutorial": "If $$$\\sum\\limits_{i=1}^n a_i \\le s$$$ then answer is . Otherwise let's find we minimum index $$$x$$$ such that $$$\\sum\\limits_{i=1}^x a_i > s$$$. It's useless to skip a part $$$i > x$$$, because Vasya just has not time to recite previous part (it's change nothing). So he has to skip a part $$$i \\le x$$$. And among such parts it's beneficial to skip part with maximum value of $$$a_i$$$.", "solution": "for t in range(int(input())):\n    n, t = map(int, input().split())\n    a = list(map(int, input().split()))\n    id = 0\n    for i in range(n):\n        if a[i] > a[id]:\n            id = i\n        t -= a[i]\n        if t < 0:\n            break\n\n    if t >= 0:\n        id = -1 \n    print(id + 1)", "interactive": false, "noSolution": false, "noTutorial": false}