{"link": "https://codeforces.com//contest/1194/problem/B", "problemId": "372216", "shortId": "1194B", "contest_number": "1194", "name": "B. Yet Another Crosses Problem", "statement": "You are given a picture consisting of  rows and  columns. Rows are numbered from  to  from the top to the bottom, columns are numbered from  to  from the left to the right. Each cell is painted either black or white. You think that this picture is not interesting enough. You consider a picture to be interesting if there is at least one  in it. A cross is represented by a pair of numbers  and , where  and , such that  in row  and  in column  are painted black.For examples, each of these pictures contain crosses:  The fourth picture contains 4 crosses: at , ,  and .Following images don't contain crosses:  You have a brush and a can of black paint, so you can make this picture interesting. Each minute you may choose a white cell and paint it black.What is the minimum number of minutes you have to spend so the resulting picture contains at least one cross?You are also asked to answer multiple independent queries.", "input": "The first line contains an integer  () — the number of queries. The first line of each query contains two integers  and  (, ) — the number of rows and the number of columns in the picture. Each of the next  lines contains  characters — '' if the cell is painted white and '' if the cell is painted black. It is guaranteed that  and .", "output": "Print  lines, the -th line should contain a single integer — the answer to the -th query, which is the minimum number of minutes you have to spend so the resulting picture contains at least one cross.", "tutorial": "Let's consider each cell as a center of a cross and take the fastest one to paint. Calculating each time naively will take  overall, which is too slow. Notice how the answer for some cell  can be represented as  ( if  is white else ), where  is the number of white cells in row  and  is the same for column . The first two terms can be precalculated beforehand.Overall complexity:  per query.", "solution": "#include <bits/stdc++.h>\n\n#define forn(i, n) for (int i = 0; i < int(n); i++)\n\nusing namespace std;\n\n\nint main() {\n\tint q;\n\tcin >> q;\n\tforn(_, q){\n\t\tint n, m;\n\t\tcin >> n >> m;\n\t\tvector<string> s(n);\n\t\tforn(i, n)\n\t\t\tcin >> s[i];\n\t\tvector<int> cntn(n), cntm(m);\n\t\tforn(i, n) forn(j, m){\n\t\t\tcntn[i] += (s[i][j] == '.');\n\t\t\tcntm[j] += (s[i][j] == '.');\n\t\t}\n\t\tint ans = n + m;\n\t\tforn(i, n) forn(j, m){\n\t\t\tans = min(ans, cntn[i] + cntm[j] - (s[i][j] == '.'));\n\t\t}\n\t\tcout << ans << \"\\n\";\n\t}\n\treturn 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}