{"link": "https://codeforces.com//contest/1633/problem/C", "problemId": "1280035", "shortId": "1633C", "contest_number": "1633", "name": "C. Kill the Monster", "statement": "Monocarp is playing a computer game. In this game, his character fights different monsters.A fight between a character and a monster goes as follows. Suppose the character initially has health  and attack ; the monster initially has health  and attack . The fight consists of several steps:  the character attacks the monster, decreasing the monster's health by ;  the monster attacks the character, decreasing the character's health by ;  the character attacks the monster, decreasing the monster's health by ;  the monster attacks the character, decreasing the character's health by ;  and so on, until the end of the fight. The fight ends when someone's health becomes non-positive (i. e.  or less). If the monster's health becomes non-positive, the character wins, otherwise the monster wins.Monocarp's character currently has health equal to  and attack equal to . He wants to slay a monster with health equal to  and attack equal to . Before the fight, Monocarp can spend up to  coins to upgrade his character's weapon and/or armor; each upgrade costs exactly one coin, each weapon upgrade increases the character's attack by , and each armor upgrade increases the character's health by .Can Monocarp's character slay the monster if Monocarp spends coins on upgrades optimally?", "input": "The first line contains one integer  () — the number of test cases. Each test case consists of three lines: The first line contains two integers  and  (; ) — the character's health and attack; The second line contains two integers  and  (; ) — the monster's health and attack; The third line contains three integers ,  and  (; ; ) — the maximum number of coins that Monocarp can spend, the amount added to the character's attack with each weapon upgrade, and the amount added to the character's health with each armor upgrade, respectively. The sum of  over all test cases does not exceed .", "output": "For each test case, print  if it is possible to slay the monster by optimally choosing the upgrades. Otherwise, print .", "tutorial": "First of all, let's understand how to solve the problem without upgrades. To do this, it is enough to compare two numbers:  and  — the number of attacks that the character needs to kill the monster and the number of attacks that the monster needs to kill the character, respectively. So, if the first number is not greater than the second number, then the character wins.Note that the number of coins is not very large, which means we can iterate over the number of coins that we will spend on weapon upgrades, and the remaining coins will be spent on armor upgrades. After that, we can use the formula described above to check whether the character will win.The complexity of the solution is .", "solution": "for _ in range(int(input())):\n    hc, dc = map(int, input().split())\n    hm, dm = map(int, input().split())\n    k, w, a = map(int, input().split())\n    for i in range(k + 1):\n        nhc = hc + i * a\n        ndc = dc + (k - i) * w\n        if (hm + ndc - 1) // ndc <= (nhc + dm - 1) // dm:\n            print(\"YES\")\n            break\n    else:\n        print(\"NO\")", "interactive": false, "noSolution": false, "noTutorial": false}