{"link": "https://codeforces.com//contest/1221/problem/C", "problemId": "415609", "shortId": "1221C", "contest_number": "1221", "name": "C. Perfect Team", "statement": "You may have already known that a standard ICPC team consists of exactly three members. The perfect team however has more restrictions. A student can have some specialization: coder or mathematician. So the team is considered perfect if it includes at least one coder, at least one mathematician and it consists of exactly three members.You are a coach at a very large university and you know that  of your students are coders,  are mathematicians and  have no specialization.What is the maximum number of full perfect teams you can distribute them into? Note that some students can be left without a team and each student can be a part of no more than one team.You are also asked to answer  independent queries.", "input": "The first line contains a single integer  () — the number of queries.  Each of the next  lines contains three integers ,  and  () — the number of coders, mathematicians and students without any specialization in the university, respectively. Note that the no student is both coder and mathematician at the same time. ", "output": "Print  integers — the -th of them should be the answer to the  query in the order they are given in the input. The answer is the maximum number of full perfect teams you can distribute your students into. ", "tutorial": "Notice that if , then you can equalize them to the min and re-qualify the rest into students without specialization. That won't change the answer.Now analyze the possible team formations: 1 of each kind, 2 coders and 1 mathematician or 1 coder and 2 mathematicians. Each of these squads have 1 coder and 1 mathematician, so you can only choose the type of the third member.The students without specialization can only be used in the first kind of teams, so let's use them first. After that you might have been left with a nonzero count of coders and mathematicians. These are equal however, so  can be added to the answer.This solves each query in .You can also run a binary search and solve each query in . ", "solution": "t = int(input())\nfor i in range(t):\n\tc, m, x = map(int, input().split())\n\td = max(c, m) - min(c, m)\n\tx += d\n\tif(c > m):\n\t\tc -= d\n\telse:\n\t\tm -= d\n\tans = min(c, m, x)\n\tc -= ans\n\tm -= ans\n\tx -= ans\n\tans += (c + m) // 3\n\tprint(ans)", "interactive": false, "noSolution": false, "noTutorial": false}