{"link": "https://codeforces.com//contest/1455/problem/C", "problemId": "815716", "shortId": "1455C", "contest_number": "1455", "name": "C. Ping-pong", "statement": "Alice and Bob play ping-pong with simplified rules.During the game, the player serving the ball commences a play. The server strikes the ball then the receiver makes a return by hitting the ball back. Thereafter, the server and receiver must alternately make a return until one of them doesn't make a return.The one who doesn't make a return loses this play. The winner of the play commences the next play. Alice starts the first play.Alice has  stamina and Bob has . To hit the ball (while serving or returning) each player spends  stamina, so if they don't have any stamina, they can't return the ball (and lose the play) or can't serve the ball (in this case, the other player serves the ball instead). If both players run out of stamina, the game is over.Sometimes, it's strategically optimal not to return the ball, lose the current play, but save the stamina. On the contrary, when the server commences a play, they have to hit the ball, if they have some stamina left.Both Alice and Bob play optimally and want to, firstly, maximize their number of wins and, secondly, minimize the number of wins of their opponent.Calculate the resulting number of Alice's and Bob's wins.", "input": "The first line contains a single integer  () — the number of test cases. The first and only line of each test case contains two integers  and  () — Alice's and Bob's initial stamina.", "output": "For each test case, print two integers — the resulting number of Alice's and Bob's wins, if both of them play optimally.", "tutorial": "Let's find an answer for a little different version of the game. Let's say that  is the final score if the first player has  stamina and the second has  stamina. The first player can either hit the ball or .How to calculate ? Obviously,  and . Otherwise, the first player can   either hit the ball: then the player spent  stamina and now it's to the second player to decide — hit or lose. So basically, we moved to the state  and the answer in this case is  where ;  or lose the play: then the player doesn't spend any stamina, but the opponent  serve the ball. He serves the ball, spend  stamina and return to the state, where the first player decides — hit or lose. Formally, the answer in this case is . Looking at ,  and one of transitions  we can guess that  and prove it by induction:  is either  or , but  and  and  is better than , so .The final step is to note that since Alice starts the first play and  serve ball — the answer is .", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nvoid solve() {\n\tint x, y;\n\tcin >> x >> y;\n\tcout << x - 1 << \" \" << y << endl;\t\n}\n\nint main() {\n\tint t;\n\tcin >> t;\n\twhile (t--) solve();\n}", "interactive": false, "noSolution": false, "noTutorial": false}