{"link": "https://codeforces.com//contest/1487/problem/D", "problemId": "897750", "shortId": "1487D", "contest_number": "1487", "name": "D. Pythagorean Triples", "statement": "A Pythagorean triple is a triple of integer numbers  such that it is possible to form a right triangle with the lengths of the first cathetus, the second cathetus and the hypotenuse equal to ,  and , respectively. An example of the Pythagorean triple is .Vasya studies the properties of right triangles, and he uses a formula that determines if some triple of integers is Pythagorean. Unfortunately, he has forgotten the exact formula; he remembers only that the formula was some equation with squares. So, he came up with the following formula: .Obviously, this is not the right formula to check if a triple of numbers is Pythagorean. But, to Vasya's surprise, it actually worked on the triple : , so, according to Vasya's formula, it is a Pythagorean triple.When Vasya found the right formula (and understood that his formula is wrong), he wondered: how many are there triples of integers  with  such that they are Pythagorean both according to his formula and the real definition? He asked you to count these triples.", "input": "The first line contains one integer  () — the number of test cases. Each test case consists of one line containing one integer  ().", "output": "For each test case, print one integer — the number of triples of integers  with  such that they are Pythagorean according both to the real definition and to the formula Vasya came up with.", "tutorial": "We have to find the number of triples () such that equations  and  are satisfied. Let's subtract one equation from another and get that . So we know that  and after substituting, we get that . We can see that there is only one correct value of  (and ) for every odd value of  (greater than ). So we can iterate over the value of  and check that the corresponding value of  doesn't exceed . This solution works in  because , but you can also solve it in .", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nint main() {\n  int t;\n  cin >> t;\n  while (t--) {\n    int n;\n    cin >> n;\n    int ans = 0;\n    for (int i = 3; i * i <= 2 * n - 1; i += 2)\n      ++ans;\n    cout << ans << '\\n';\n  }\n}", "interactive": false, "noSolution": false, "noTutorial": false}