{"link": "https://codeforces.com//contest/1327/problem/E", "problemId": "571328", "shortId": "1327E", "contest_number": "1327", "name": "E. Count The Blocks", "statement": "You wrote down all integers from  to , padding them with leading zeroes so their lengths are exactly . For example, if  then you wrote out , , ..., , .A block in an integer  is a consecutive segment of equal digits that cannot be extended to the left or to the right.For example, in the integer  there are three blocks of length , one block of length  and two blocks of length .For all integers  from  to  count the number of blocks of length  among the written down integers.Since these integers may be too large, print them modulo .", "input": "The only line contains one integer  ().", "output": "In the only line print  integers. The -th integer is equal to the number of blocks of length . Since these integers may be too large, print them modulo .", "tutorial": "Presume that we want to calculate the number of blocks of length . Let's divide this blocks into two types:  blocks which first element is a first element of integer, or blocks which last element is a last element of integer (for example blocks  and  in integer );  other blocks. At first let's calculate the number of blocks of first type. We can choose  positions of this block (at the start of end of the integer). Now we can choose  digit for this block. After that we can chose  digits of adjacent block (if these blocks contain the same digit then we length of blocks which we want calculate greater than , so we have only  variations of digit in adjacent block). Finally, the can chose the remaining digit  ways.So, the total number of block of first type is .Now let's calculate the number of blocks of second type. We can choose  positions of this block (all position except the start and end of integer). Now we can choose 10 digit for this block. After that we can chose  digits of adjacent block ( for block to the left and  for block to the right). Finally, the can chose the remaining digit  ways.So, the total number of block of second type is .That's almost all. We have one corner case. If , then we number of blocks is always .", "solution": "MOD = 998244353\np = [1] * 200005\nfor i in range(1, 200005):\n    p[i] = (p[i - 1] * 10) % MOD\n\nn = int(input())\nfor i in range(1, n):\n    res = 2 * 10 * 9 * p[n - i - 1]\n    res += (n - 1 - i) * 10 * 9 * 9 * p[n - i - 2]\n    print(res % MOD, end = ' ')\nprint(10)", "interactive": false, "noSolution": false, "noTutorial": false}