{"link": "https://codeforces.com//contest/1519/problem/E", "problemId": "971590", "shortId": "1519E", "contest_number": "1519", "name": "E. Off by One", "statement": "There are  points on an infinite plane. The -th point has coordinates  such that  and . The coordinates are not necessarily integer.In one move you perform the following operations:   choose two points  and  ();  move point  from  to either  or ;  move point  from  to either  or ;  remove points  and .  Otherwise, the move can't be performed and the points stay at their original coordinates  and , respectively.The numeration of points  after some points are removed. Once the points are removed, they can't be chosen in any later moves. Note that you have to move both points during the move, you can't leave them at their original coordinates.What is the maximum number of moves you can perform? What are these moves?If there are multiple answers, you can print any of them.", "input": "The first line contains a single integer  () — the number of points. The -th of the next  lines contains four integers  (). The coordinates of the -th point are  and .", "output": "In the first line print a single integer  — the maximum number of moves you can perform. Each of the next  lines should contain a description of a move: two integers  and  (, ) — the points that are removed during the current move. There should be a way to move points  and  according to the statement so that there's a line that passes through the new coordinates of , the new coordinates of  and . No removed point can be chosen in a later move. If there are multiple answers, you can print any of them. You can print the moves and the points in the move in the arbitrary order.", "tutorial": "At first the problem sounds like some sort of matching. However, it seems like you first want to match each point with either of its moves and then some pairs of points to each other. That doesn't sound viable but since the matchings are often connected with graphs, the graph idea might come handy.Let's first consider a pair of matched points. What does it actually mean that there exists a line through their new coordinates and ? It's the same as: the angles of a line through the new coordinates of  and  and a line through the new coordinates of  and  are the same. Angles are the same means that their tangents are the same (and vice versa since we only consider the first quadrant of the plane). So we can conclude that  or  of the first point should be equal to any of these of the second point.Now consider the following graph. Various values of tangents of the lines are the nodes. Each point produces an edge between their  and . What are the matched pairs of points in this graph? It's such a pair of edges that they share at least one endpoint.Building a graph is the slowest part of the solution since you have to use some data structure (or at least a sort and a binary search).  is possible with some sort of hashmap but  should be perfectly fine as well.So we reduced the problem to a more well-known one: given an arbitrary undirected graph, find the maximum number of pairs of edges such that each pair shares at least one endpoint and each edge is included in no more than one pair.The upper bound on the answer is the following. Let  be the number of edges in the -th connected component. Best case we can make  pairs from it. Let's come up with an algorithm to achieve this bound.Consider a dfs tree of a component. It's known that a dfs tree of an undirected graph contains no cross edges. So if we direct all the edges of a dfs tree downwards (convert all back edges to forward edges), each edge will connect some vertex to its descendant. Imagine we came up with a dfs such that  matches all the edges that have their upper node in the subtree of  to each other (except one edge in case there is an odd number of them).  will solve the task exactly then.How should that dfs work exactly?What if there were no forward edges at all? That case is easy since all edges are tree edges. We'll try to maintain an invariant that the only unmatched edge is an edge that has  as one of its endpoints. If  is a leaf, then there's nothing to match. Otherwise, we go into some child . If it can't match all its edges, then match its remaining edge to an edge . If it can then remember that we have an edge  unmatched so far. Go into another child . Same, match our edge with its edge if it has one unmatched. However, if  turned out to get unmatched and  turned out to be unmatched, then you can match them to each other. This way you will be left with at most one unmatched edge after you process all the children, and that edge has its endpoint at .Add the forward edges back. Did anything change? Look at the forward edge that has its upper vertex the lowest. We can see that it points to a vertex  that has its subtree fully matches. So why don't we treat this forward edge the same as an edge to a leaf? Forget that  has some subtree of its own and just believe that you can't match the edge  so far. Proceed the same as the easy case.Since we mark exactly which edges you pair up with which, it's trivial to retrieve the answer.Overall complexity: .", "solution": "#include <bits/stdc++.h>\n\n#define forn(i, n) for (int i = 0; i < int(n); i++)\n#define x first\n#define y second\n\nusing namespace std;\n\nstruct point{\n    int a, b, c, d;\n};\n\ntypedef pair<long long, long long> frac;\ntypedef pair<int, int> pt;\n\nint n;\nvector<point> a;\nmap<frac, int> sv;\n\nfrac norm(long long x, long long y){\n    long long g = __gcd(x, y);\n    return {x / g, y / g};\n}\n\nvector<vector<pt>> g;\nvector<int> used;\nvector<pt> ans;\n\nint dfs(int v){\n    used[v] = 1;\n    int cur = -1;\n    for (auto it : g[v]){\n        int u = it.x;\n        int i = it.y;\n        if (used[u] == 1) continue;\n        int nw = i;\n        if (!used[u]){\n            int tmp = dfs(u);\n            if (tmp != -1){\n                ans.push_back({nw, tmp});\n                nw = -1;\n            }\n        }\n        if (nw != -1){\n            if (cur != -1){\n                ans.push_back({cur, nw});\n                cur = -1;\n            }\n            else{\n                cur = nw;\n            }\n        }\n    }\n    used[v] = 2;\n    return cur;\n}\n\nint main() {\n    scanf(\"%d\", &n);\n    a.resize(n);\n    forn(i, n) scanf(\"%d%d%d%d\", &a[i].a, &a[i].b, &a[i].c, &a[i].d);\n    g.resize(2 * n);\n    forn(i, n){\n        frac f1 = norm((a[i].a + a[i].b) * 1ll * a[i].d, a[i].b * 1ll * a[i].c);\n        frac f2 = norm(a[i].a * 1ll * a[i].d, a[i].b * 1ll * (a[i].c + a[i].d));\n        if (!sv.count(f1)){\n            int k = sv.size();\n            sv[f1] = k;\n        }\n        if (!sv.count(f2)){\n            int k = sv.size();\n            sv[f2] = k;\n        }\n        g[sv[f1]].push_back({sv[f2], i});\n        g[sv[f2]].push_back({sv[f1], i});\n    }\n    used.resize(sv.size());\n    forn(i, sv.size()) if (!used[i])\n        dfs(i);\n    printf(\"%d\\n\", int(ans.size()));\n    for (auto it : ans) printf(\"%d %d\\n\", it.x + 1, it.y + 1);\n}", "interactive": false, "noSolution": false, "noTutorial": false}