{"link": "https://codeforces.com//contest/1202/problem/F", "problemId": "385667", "shortId": "1202F", "contest_number": "1202", "name": "F. You Are Given Some Letters...", "statement": "You are given  uppercase Latin letters 'A' and  letters 'B'.The period of the string is the smallest such positive integer  that  (-indexed) for each . Note that this implies that  won't always divide .For example, the period of string \"ABAABAA\" is , the period of \"AAAA\" is , and the period of \"AABBB\" is .Find the number of different periods over all possible strings with  letters 'A' and  letters 'B'.", "input": "The first line contains two integers  and  () — the number of letters 'A' and 'B', respectively.", "output": "Print the number of different periods over all possible strings with  letters 'A' and  letters 'B'.", "tutorial": "Let's introduce the slightly naive solution. Iterate over all values for periods and check the possibility of each one being correct.The conditions for some period  can be formulated the following way.  ( is the total length of the string) is the number of full periods of length . Let's find at least one such pair  and  such that  and the remainder part of the string can be filled with  letters 'A' and  letters 'B'. By easy construction one can deduce that the conditions of  and  are enough. Thus  should be greater or equal to  and .In order to move to the faster solution one should also remember that both remainder parts  and  should be non-negative.Let's learn how to solve the problem for the whole range of lengths which all have the number of full periods equal to the same value . Let this range be . From the aforementioned formulas one can notice that the restrictions on both  and  don't depend on the length itself but only on value of . To be more specific: The lowest and the highest values for  and  will be the following:   It is claimed that every value between  and  exists if the values are valid ( and ).The full proof about the given conditions being sufficient and the existence of every value on that range is left to the reader. Some kind of a hint might be the suggestion to check how the inequalities change on the transition from some period  to .Restrict the values by  and  to count each answer on exactly one range of lengths. Finally, the value of  is added to the answer.The number of ranges with the same  is .Overall complexity: .", "solution": "#include <bits/stdc++.h>\n\n#define forn(i, n) for (int i = 0; i < int(n); i++)\n\nusing namespace std;\n\nint main() {\n\tint a, b;\n\tscanf(\"%d%d\", &a, &b);\n\t\n\tint n = a + b;\n\tint ans = 0;\n\tint l = 1;\n\twhile (l <= n){\n\t\tint g = n / l;\n\t\t\n\t\tif (a < g || b < g){\n\t\t\tl = n / g + 1;\n\t\t\tcontinue;\n\t\t}\n\t\t\n\t\tint r = n / g;\n\t\t\n\t\tint a_low = (a + g) / (g + 1);\n\t\tint a_high = a / g;\n\t\tint b_low = (b + g) / (g + 1);\n\t\tint b_high = b / g;\n\t\t\n\t\tif (a_low <= a_high && b_low <= b_high)\n\t\t\tans += max(0, min(r, a_high + b_high) - max(l, a_low + b_low) + 1);\n\t\tl = r + 1;\n\t}\n\t\n\tprintf(\"%d\\n\", ans);\n}", "interactive": false, "noSolution": false, "noTutorial": false}