{"link": "https://codeforces.com//contest/1296/problem/A", "problemId": "531582", "shortId": "1296A", "contest_number": "1296", "name": "A. Array with Odd Sum", "statement": "You are given an array  consisting of  integers.In one move, you can choose two indices  such that  and set . You can perform such moves any number of times (possibly, zero). You can choose different indices in different operations. The operation := is the operation of assignment (i.e. you choose  and  and replace  with ).Your task is to say if it is possible to obtain an array with an odd (not divisible by ) sum of elements.You have to answer  independent test cases.", "input": "The first line of the input contains one integer  () — the number of test cases. The next  lines describe test cases. The first line of the test case contains one integer  () — the number of elements in . The second line of the test case contains  integers  (), where  is the -th element of . It is guaranteed that the sum of  over all test cases does not exceed  ().", "output": "For each test case, print the answer on it — \"\" (without quotes) if it is possible to obtain the array with an odd sum of elements, and \"\" otherwise.", "tutorial": "Firstly, if the array already has an odd sum, the answer is \"\". Otherwise, we need to change the parity of the sum, so we need to change the parity of some number. We can do in only when we have at least one even number and at least one odd number. Otherwise, the answer is \"\".", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nint main() {\n#ifdef _DEBUG\n\tfreopen(\"input.txt\", \"r\", stdin);\n//\tfreopen(\"output.txt\", \"w\", stdout);\n#endif\n\t\n\tint t;\n\tcin >> t;\n\twhile (t--) {\n\t\tint n;\n\t\tcin >> n;\n\t\tint sum = 0;\n\t\tbool odd = false, even = false;\n\t\tfor (int i = 0; i < n; ++i) {\n\t\t\tint x;\n\t\t\tcin >> x;\n\t\t\tsum += x;\n\t\t\todd |= x % 2 != 0;\n\t\t\teven |= x % 2 == 0;\n\t\t}\n\t\tif (sum % 2 != 0 || (odd && even)) cout << \"YES\" << endl;\n\t\telse cout << \"NO\" << endl;\n\t}\n\t\n\treturn 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}