{"link": "https://codeforces.com//contest/988/problem/A", "problemId": "186726", "shortId": "988A", "contest_number": "988", "name": "A. Diverse Team", "statement": "There are  students in a school class, the rating of the -th student on Codehorses is . You have to form a team consisting of  students () such that the ratings of all team members .If it is impossible to form a suitable team, print \"\" (without quotes). Otherwise print \"\", and then print  distinct numbers which should be the indices of students in the team you form. If there are multiple answers, print any of them.", "input": "The first line contains two integers  and  () — the number of students and the size of the team you have to form. The second line contains  integers  (), where  is the rating of -th student.", "output": "If it is impossible to form a suitable team, print \"\" (without quotes). Otherwise print \"\", and then print  distinct integers from  to  which should be the indices of students in the team you form. All the ratings of the students in the team should be distinct. You may print the indices in any order. If there are multiple answers, print any of them. Assume that the students are numbered from  to .", "tutorial": "Let's write our \"unique\" function. Keep the array of the taken elements . Iterate over all elements in the array  and if the current element is not used () then add its index  to the answer and set . When finished, check the number of distinct values (that is the size of answer array). If it is less than , print \"\". Otherwise print \"\" and output the first  elements of the answer.", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nint main() {\n#ifdef _DEBUG\n\tfreopen(\"input.txt\", \"r\", stdin);\n//\tfreopen(\"output.txt\", \"w\", stdout);\n#endif\n\t\n\tint n, k;\n\tcin >> n >> k;\n\tset<int> el;\n\tvector<int> ans;\n\tfor (int i = 0; i < n; ++i) {\n\t\tint x;\n\t\tcin >> x;\n\t\tif (!el.count(x)) {\n\t\t\tans.push_back(i);\n\t\t\tel.insert(x);\n\t\t}\n\t}\n\t\n\tif (int(ans.size()) < k) {\n\t\tcout << \"NO\\n\";\n\t} else {\n\t\tcout << \"YES\\n\";\n\t\tfor (int i = 0; i < k; ++i)\n\t\t\tcout << ans[i] + 1 << \" \";\n\t\tcout << endl;\n\t}\n\t\n\treturn 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}