{"link": "https://codeforces.com//contest/1520/problem/A", "problemId": "976796", "shortId": "1520A", "contest_number": "1520", "name": "A. Do Not Be Distracted ", "statement": "Polycarp has  tasks. Each task is designated by a capital letter of the Latin alphabet.The teacher asked Polycarp to solve tasks in the following way: if Polycarp began to solve some task, then he must solve it to the end, without being distracted by another task. After switching to another task, Polycarp cannot return to the previous task.Polycarp can only solve one task during the day. Every day he wrote down what task he solved. Now the teacher wants to know if Polycarp followed his advice.For example, if Polycarp solved tasks in the following order: \"\", then the teacher will see that on the third day Polycarp began to solve the task '', then on the fifth day he got distracted and began to solve the task '', on the eighth day Polycarp returned to the task ''. Other examples of when the teacher is suspicious: \"\", \"\" and \"\".If Polycarp solved the tasks as follows: \"\", then the teacher cannot have any suspicions. Please note that Polycarp is not obligated to solve all tasks. Other examples of when the teacher doesn't have any suspicious: \"\", \"\" and \"\".Help Polycarp find out if his teacher might be suspicious.", "input": "The first line contains an integer  (). Then  test cases follow. The first line of each test case contains one integer  () — the number of days during which Polycarp solved tasks. The second line contains a string of length , consisting of uppercase Latin letters, which is the order in which Polycarp solved the tasks.", "output": "For each test case output:    \"\", if the teacher ;  \"\", otherwise.  You may print every letter in any case you want (so, for example, the strings , ,  and  are all recognized as positive answer).", "tutorial": "The simplest solution — go through the problem, because of which the teacher might have suspicions. Now you can find the first day when Polycarp solved this problem and the last such day. Between these two days, all problems should be the same. If this is not the case, the answer is \"\".", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nusing ll = long long;\nusing ld = long double;\nusing pii = pair<int, int>;\nusing cd = complex<ld>;\n\nvoid solve() {\n    int n;\n    cin >> n;\n    string s;\n    cin >> s;\n    for (char c = 'A'; c <= 'Z'; c++) {\n        int first = n;\n        int last = -1;\n        for (int i = 0; i < n; i++) {\n            if (s[i] == c) {\n                first = min(first, i);\n                last = max(last, i);\n            }\n        }\n        for (int i = first; i <= last; i++) {\n            if (s[i] != c) {\n                cout << \"NO\\n\";\n                return;\n            }\n        }\n    }\n    cout << \"YES\\n\";\n}\n\nint main() {\n    ios_base::sync_with_stdio(false);\n    cin.tie(nullptr);\n    int t;\n    cin >> t;\n    while (t--) {\n        solve();\n    }\n}", "interactive": false, "noSolution": false, "noTutorial": false}