{"link": "https://codeforces.com//contest/1650/problem/A", "problemId": "1321160", "shortId": "1650A", "contest_number": "1650", "name": "A. Deletions of Two Adjacent Letters", "statement": "The string  is given, the string length is  number. The string consists of lowercase letters of the Latin alphabet.As long as the string length is greater than , the following operation can be performed on it: select any two adjacent letters in the string  and delete them from the string. For example, from the string \"\" in one operation, you can get any of the four strings: \"\", \"\", \"\" or \"\" In particular, in one operation, the length of the string reduces by .Formally, let the string  have the form  (). During one operation, you choose an arbitrary index  () and replace .For the given string  and the letter , determine whether it is possible to make such a sequence of operations that in the end the equality  will be true? In other words, is there such a sequence of operations that the process will end with a string of length , which consists of the letter ?", "input": "The first line of input data contains an integer  () — the number of input test cases. The descriptions of the  cases follow. Each test case is represented by two lines:   string , which has an odd length from  to  inclusive and consists of lowercase letters of the Latin alphabet;  is a string containing one letter , where  is a lowercase letter of the Latin alphabet. ", "output": "For each test case in a separate line output:  , if the string  can be converted so that  is true;  otherwise.  You can output  and  in any case (for example, the strings , ,  and  will be recognized as a positive response).", "tutorial": "There will be one character left in the end, so we have to delete all the characters going before and after it. That is, delete some prefix and suffix. Since we always delete some substring of length , we can only delete the prefix and suffix of even length, it means the answer is  in the case when there is an odd position in  with the character  and  otherwise.", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\n#define forn(i, n) for (int i = 0; i < int(n); i++)\n\nint main() {\n    int t;\n    cin >> t;\n    forn(tt, t) {\n        string s, t;\n        cin >> s >> t;\n        bool yes = false;\n        forn(i, s.length())\n            if (s[i] == t[0] && i % 2 == 0)\n                yes = true;\n        cout << (yes ? \"YES\" : \"NO\") << endl;\n    }\n}", "interactive": false, "noSolution": false, "noTutorial": false}