{"link": "https://codeforces.com//contest/1176/problem/A", "problemId": "356083", "shortId": "1176A", "contest_number": "1176", "name": "A. Divide it ", "statement": "You are given an integer .You can perform any of the following operations with this number an arbitrary (possibly, zero) number of times:   Replace  with  if  is divisible by ;  Replace  with  if  is divisible by ;  Replace  with  if  is divisible by . For example, you can replace  with  using the first operation, with  using the second operation or with  using the third operation.Your task is to find the minimum number of moves required to obtain  from  or say that it is impossible to do it.You have to answer  independent queries.", "input": "The first line of the input contains one integer  () — the number of queries. The next  lines contain the queries. For each query you are given the integer number  ().", "output": "Print the answer for each query on a new line. If it is impossible to obtain  from , print . Otherwise, print the minimum number of moves required to do it.", "tutorial": "What if the given number  cannot be represented as ? It means that the answer is  because all actions we can do are: remove one power of two, remove one power of three and add one power of two, and remove one power of five and add two powers of two. So if the answer is not  then it is . If this formula isn't pretty clear for you, you can just simulate the process, performing actions from third to first.", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nint main() {\n#ifdef _DEBUG\n\tfreopen(\"input.txt\", \"r\", stdin);\n//\tfreopen(\"output.txt\", \"w\", stdout);\n#endif\n\t\n\tint q;\n\tcin >> q;\n\tfor (int i = 0; i < q; ++i) {\n\t\tlong long n;\n\t\tcin >> n;\n\t\tint cnt2 = 0, cnt3 = 0, cnt5 = 0;\n\t\twhile (n % 2 == 0) {\n\t\t\tn /= 2;\n\t\t\t++cnt2;\n\t\t}\n\t\twhile (n % 3 == 0) {\n\t\t\tn /= 3;\n\t\t\t++cnt3;\n\t\t}\n\t\twhile (n % 5 == 0) {\n\t\t\tn /= 5;\n\t\t\t++cnt5;\n\t\t}\n\t\tif (n != 1) {\n\t\t\tcout << -1 << endl;\n\t\t} else {\n\t\t\tcout << cnt2 + cnt3 * 2 + cnt5 * 3 << endl;\n\t\t}\n\t}\n\t\n\treturn 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}