{"link": "https://codeforces.com//contest/1714/problem/A", "problemId": "1490427", "shortId": "1714A", "contest_number": "1714", "name": "A. Everyone Loves to Sleep", "statement": "Vlad, like everyone else, loves to sleep very much.Every day Vlad has to do  things, each at a certain time. For each of these things, he has an alarm clock set, the -th of them is triggered on  hours  minutes every day (). Vlad uses the -hour time format, so after  comes  and after  comes .This time Vlad went to bed at  hours  minutes () and asks you to answer: how much he will be able to sleep until the next alarm clock.If any alarm clock rings at the time when he went to bed, then he will sleep for a period of time of length .", "input": "The first line of input data contains an integer  () — the number of test cases in the test. The first line of the case contains three integers ,  and  () — the number of alarms and the time Vlad went to bed. The following  lines contain two numbers each  and  () — the time of the  alarm. It is acceptable that two or more alarms will trigger at the same time. Numbers describing time do not contain leading zeros.", "output": "Output  lines, each containing the answer to the corresponding test case. As an answer, output two numbers  — the number of hours and minutes that Vlad will sleep, respectively. If any alarm clock rings at the time when he went to bed, the answer will be .", "tutorial": "To begin with, let's learn how to determine how much time must pass before the  alarm to trigger. If the alarm time is later than the current one, then obviously  minutes should pass. Otherwise, this value will be negative and then it should pass  since a full day must pass, not including the time from the alarm to the current time. We just need to find the minimum number of minutes among all the alarm clocks.Due to small constrains, the problem can also be solved by stimulating the sleep process: increase the answer by  and check whether any alarm will work after this time.", "solution": "#include <bits/stdc++.h>\n\n#define int long long\n#define pb emplace_back\n#define mp make_pair\n#define x first\n#define y second\n#define all(a) a.begin(), a.end()\n#define rall(a) a.rbegin(), a.rend()\n\ntypedef long double ld;\ntypedef long long ll;\n\nusing namespace std;\n\nmt19937 rnd(143);\n\nconst int inf = 1e15;\nconst int M = 1e9 + 7;\nconst ld pi = atan2(0, -1);\nconst ld eps = 1e-6;\n\nvoid solve(){\n    int n;\n    cin >> n;\n    int time, h, m;\n    cin >> h >> m;\n    time = 60 * h + m;\n    int ans = 24 * 60;\n    for(int i = 0; i < n; ++i){\n        cin >> h >> m;\n        int t = 60 * h + m - time;\n        if(t < 0) t += 24 * 60;\n        ans = min(ans, t);\n    }\n    cout << ans / 60 << \" \" << ans % 60;\n}\n\nbool multi = true;\n\nsigned main() {\n    int t = 1;\n    if (multi)cin >> t;\n    for (; t; --t) {\n        solve();\n        cout << endl;\n    }\n    return 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}