{"link": "https://codeforces.com//contest/1593/problem/A", "problemId": "1142161", "shortId": "1593A", "contest_number": "1593", "name": "A. Elections", "statement": "The elections in which three candidates participated have recently ended. The first candidate received  votes, the second one received  votes, the third one received  votes. For each candidate, solve the following problem: how many votes should be added to this candidate so that he wins the election (i.e. the number of votes for this candidate was strictly greater than the number of votes for any other candidate)?Please note that for each candidate it is necessary to solve this problem , i.e. the added votes for any candidate  affect the calculations when getting the answer for the other two candidates.", "input": "The first line contains one integer  () — the number of test cases. Then  test cases follow. Each test case consists of one line containing three integers , , and  ().", "output": "For each test case, output in a separate line three integers , , and  () separated by spaces — the answers to the problem for the first, second, and third candidate, respectively.", "tutorial": "Let's solve the problem for the first candidate. To win the election, he needs to get at least  more votes than every other candidate. Therefore, the first candidate needs to get at least  votes. If  is already greater than this value, then you don't need to add any votes, otherwise, you need to add  votes. So the answer for the first candidate is .Similarly, the answer for the second candidate is , and, for the third one, the answer is .", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nint solveSingle(int best, int other1, int other2)\n{\n\treturn max(0, max(other1, other2) + 1 - best);\n}\n\nint main()\n{\n\tint t;\n\tcin >> t;\n\n\twhile (t--)\n\t{\n\t\tint a, b, c;\n\t\tcin >> a >> b >> c;\n\n\t\tcout << solveSingle(a, b, c) << ' ' << solveSingle(b, a, c) << ' ' << solveSingle(c, a, b) << '\\n';\n\t}\n\n\treturn 0;\n}\n", "interactive": false, "noSolution": false, "noTutorial": false}