{"link": "https://codeforces.com//contest/1800/problem/A", "problemId": "1805842", "shortId": "1800A", "contest_number": "1800", "name": "A. Is It a Cat ", "statement": "You were walking down the street and heard a sound. The sound was described by the string  consisting of lowercase and uppercase Latin characters. Now you want to find out if the sound was a cat meowing.For the sound to be a meowing, the string can only contain the letters '', '', '' and '', in either uppercase or lowercase. Also:   string must start with non-empty sequence consisting only of characters '' or ''  it must be immediately followed by non-empty sequence consisting only of characters '' or ''  it must be immediately followed by non-empty sequence consisting only of characters '' or ''  it must be immediately followed by non-empty sequence consisting only of characters '' or '', this sequence ends the string, after it immediately comes the string end For example, strings \"\", \"\", \"\" describe a meowing, but strings \"\", \"\", \"\", \"\", \"\" do not.Determine whether the sound you heard was a cat meowing or something else.", "input": "The first line of input data contains a single integer  () — the number of test cases. The description of the test cases follows. The first line of each test case contains an integer  () — the length of the string describing the sound. The second line of each test case contains a string  of  characters. The string describes the sound you heard and consists only of lowercase and uppercase Latin letters. ", "output": "For each test case, output on a separate line:     if the sound was a cat meowing;   otherwise.  You can output  and  in any case (for example, strings , ,  and  will be recognized as positive response).", "tutorial": "To solve the problem, you may convert the string to lower case, strip all duplicated characters from it and compare the result to \"meow\" string.To exclude duplicate characters, you can, for example, use the  function in C++.", "solution": "#include <bits/stdc++.h>\nusing namespace std;\n\nvoid solve(){\n    int n;\n    cin >> n;\n    string s;\n    cin >> s;\n    transform(s.begin(), s.end(), s.begin(), [] (char c) {\n        return tolower(c);\n    });\n    s.erase(unique(s.begin(), s.end()), s.end());\n    cout << (s == \"meow\" ? \"YES\" : \"NO\") << \"\\n\";\n}\n\nint main(){\n    int t;\n    cin >> t;\n    while(t--) solve();\n}", "interactive": false, "noSolution": false, "noTutorial": false}