{"link": "https://codeforces.com//contest/1360/problem/A", "problemId": "629821", "shortId": "1360A", "contest_number": "1360", "name": "A. Minimal Square", "statement": "Find the minimum area of a  land on which you can place two identical rectangular  houses. The sides of the houses should be parallel to the sides of the desired square land.Formally,   You are given two identical rectangles with side lengths  and  () — positive integers (you are given just the sizes, but  their positions).  Find the square of the minimum area that contains both given rectangles. Rectangles can be rotated (both or just one), moved, but the sides of the rectangles should be parallel to the sides of the desired square. Two rectangles can touch each other (side or corner), but cannot intersect. Rectangles can also touch the sides of the square but must be completely inside it. You can rotate the rectangles. Take a look at the examples for a better understanding.     ", "input": "The first line contains an integer  () —the number of test cases in the input. Then  test cases follow. Each test case is a line containing two integers ,  () — side lengths of the rectangles.", "output": "Print  answers to the test cases. Each answer must be a single integer — minimal area of square land, that contains two rectangles with dimensions .", "tutorial": "Obviously that both rectangles should completely touch by one of the sides. Otherwise, you can move them closer to each other so that the total height or total width decreases, and the other dimension does not change. Thus, there are only two options:   The rectangles touch by width, we get the side of the square equal to ,  The rectangles touch by height, we get the side of the square equal to .  Thus, the minimum side of the square is equal to the minimum of these two options. Then the answer is .", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\n#define forn(i, n) for (int i = 0; i < int(n); i++)\n\nint solve(int a, int b) {\n    int side = min(max(a * 2, b), max(a, b * 2));\n    return side * side;\n}\n\nint main(int argc, char* argv[]) {\n    int t;\n    cin >> t;\n    forn(tt, t) {\n        int a, b;\n        cin >> a >> b;\n        cout << solve(a, b) << endl;\n    }\n}\n", "interactive": false, "noSolution": false, "noTutorial": false}