{"link": "https://codeforces.com//contest/1475/problem/A", "problemId": "877132", "shortId": "1475A", "contest_number": "1475", "name": "A. Odd Divisor", "statement": "You are given an integer . Check if  has an  divisor, greater than one (does there exist such a number  () that  is divisible by  and  is odd).For example, if , then there is . If , then such a number does not exist.", "input": "The first line contains one integer  () — the number of test cases. Then  test cases follow. Each test case contains one integer  (). Please note, that the input for some test cases won't fit into -bit integer type, so you should use at least -bit integer type in your programming language.", "output": "For each test case, output on a separate line:    \"\" if  has an  divisor, greater than one;  \"\" otherwise.  You can output \"\" and \"\" in any case (for example, the strings , ,  and  will be recognized as positive).", "tutorial": "If the number  has an odd divisor, then it has an odd prime divisor. To understand this fact, we can consider what happens when multiplying even and odd numbers:   even  even  even;  even  odd  even;  odd  even  even;  odd  odd  . There is only one even prime number — . So, if a number has no odd divisors, then it must be a power of two. To check this fact, for example, you can divide  by  as long as it is divisible. If at the end we got , then  — the power of two.: You can also use the following condition to check: . If the number — is a power of two, then it contains only one unit in the binary notation. Then  contains units in all positions except the one in which the unit in  is located. So their bitwise \"AND\" does not contain units.", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\nusing ll = long long;\nusing ld = long double;\n\nvoid solve() {\n  ll n;\n  cin >> n;\n  if (n & (n - 1)) {\n    cout << \"YES\\n\";\n  } else {\n    cout << \"NO\\n\";\n  }\n}\n\nint main() {\n  int t;\n  cin >> t;\n  while (t--) {\n    solve();\n  }\n}", "interactive": false, "noSolution": false, "noTutorial": false}