{"link": "https://codeforces.com//contest/1367/problem/A", "problemId": "650993", "shortId": "1367A", "contest_number": "1367", "name": "A. Short Substrings", "statement": "Alice guesses the strings that Bob made for her.At first, Bob came up with the secret string  consisting of lowercase English letters. The string  has a length of  or more characters. Then, from string  he builds a new string  and offers Alice the string  so that she can guess the string .Bob builds  from  as follows: he writes all the substrings of length  of the string  in the order from left to right, and then joins them in the same order into the string .For example, if Bob came up with the string =\"\", then all the substrings of length  of the string  are: \"\", \"\", \"\". Therefore, the string =\"\".You are given the string . Help Alice to guess the string  that Bob came up with. It is guaranteed that  was built according to the algorithm given above. It can be proved that the answer to the problem is unique.", "input": "The first line contains a single positive integer  () — the number of test cases in the test. Then  test cases follow. Each test case consists of one line in which the string  is written, consisting of lowercase English letters () — the string Bob came up with, where  is the length of the string . It is guaranteed that  was built according to the algorithm given above.", "output": "Output  answers to test cases. Each answer is the secret string , consisting of lowercase English letters, that Bob came up with.", "tutorial": "Note that the first two characters of  match the first two characters of . The third character of the string  again matches the second character of  (since it is the first character in the second substring, which contains the second and the third character of ). The fourth character  matches with the third character of .It is easy to notice that such a pattern continues further. That is, the string  consists of the first character  and all characters at even positions in .", "solution": "#include <bits/stdc++.h>\nusing namespace std;\n\nint main() {\n\tint t;\n\tcin >> t;\n\n\tfor (int test = 1; test <= t; test++) {\n\t\tstring b;\n\t\tcin >> b;\n\n\t\tstring a = b.substr(0, 2);\n\n\t\tfor (int i = 3; i < b.size(); i += 2) {\n\t\t\ta += b[i];\n\t\t}\n\n\t\tcout << a << endl;\n\t}\n\n\treturn 0;\n}\n", "interactive": false, "noSolution": false, "noTutorial": false}