{"link": "https://codeforces.com//contest/1538/problem/A", "problemId": "1011921", "shortId": "1538A", "contest_number": "1538", "name": "A. Stone Game", "statement": "Polycarp is playing a new computer game. This game has  stones in a row. The stone on the position  has integer power . .Each turn Polycarp can destroy either stone on the first position or stone on the last position (in other words, either the leftmost or the rightmost stone). When Polycarp destroys the stone it does not exist any more.Now, Polycarp wants two achievements. He gets them if he destroys the stone with the  power and the stone with the  power. Help Polycarp find out what is the minimum number of moves he should make in order to achieve his goal.For example, if  and , then Polycarp could make the following moves:   Destroy the leftmost stone. After this move ;  Destroy the rightmost stone. After this move ;  Destroy the leftmost stone. After this move . Polycarp destroyed the stones with the greatest and least power, so he can end the game. Please note that in the example above, you can complete the game in two steps. For example:   Destroy the leftmost stone. After this move ;  Destroy the leftmost stone. After this move . Polycarp destroyed the stones with the greatest and least power, so he can end the game. ", "input": "The first line contains an integer  (). Then  test cases follow. The first line of each test case contains one integer  () — the number of stones. The second line contains  distinct integers  () — the power of the stones.", "output": "For each test case, output the minimum number of moves required to destroy the stones with the greatest and the lowest power.", "tutorial": "If we want to destroy the largest and smallest stone, then there are only four options:   Destroy the stones on the left until we destroy the smallest stone. Then destroy the stones on the right, until we destroy the largest stone.  Destroy the stones on the right until we destroy the smallest stone. Then destroy the stones on the left, until we destroy the largest stone.  Destroy the stones on the left until we destroy both stones.  Destroy the stones on the right until we destroy both stones. You need to check all four options and choose the minimum answer.", "solution": "#include <bits/stdc++.h>\n#include \"random\"\n\nusing namespace std;\n\nusing ll = long long;\nusing ld = long double;\nusing pii = pair<int, int>;\nusing cd = complex<ld>;\n\nvoid solve() {\n    int n;\n    cin >> n;\n    vector<int> v(n);\n    for (int &e : v) {\n        cin >> e;\n    }\n    int maxPos = max_element(v.begin(), v.end()) - v.begin();\n    int minPos = min_element(v.begin(), v.end()) - v.begin();\n    cout << min({\n            max(maxPos, minPos) + 1,\n            (n - 1) - min(maxPos, minPos) + 1,\n            (n - 1) - maxPos + minPos + 2,\n            (n - 1) - minPos + maxPos + 2\n    }) << \"\\n\";\n}\n\nint main() {\n    ios_base::sync_with_stdio(false);\n    cin.tie(nullptr);\n    int t;\n    cin >> t;\n    while (t--) {\n        solve();\n    }\n}", "interactive": false, "noSolution": false, "noTutorial": false}