{"link": "https://codeforces.com//contest/1196/problem/A", "problemId": "377790", "shortId": "1196A", "contest_number": "1196", "name": "A. Three Piles of Candies", "statement": "Alice and Bob have received three big piles of candies as a gift. Now they want to divide these candies as fair as possible. To do this, Alice takes one pile of candies, then Bob takes one of the other two piles. The last pile is split between Alice and Bob as they want: for example, it is possible that Alice takes the whole pile, and Bob gets nothing from it.After taking the candies from the piles, if Alice has more candies than Bob, she discards some candies so that the number of candies she has is equal to the number of candies Bob has. Of course, Bob does the same if he has more candies.Alice and Bob want to have as many candies as possible, and they plan the process of dividing candies accordingly. Please calculate the maximum number of candies Alice can have after this division process (of course, Bob will have the same number of candies).You have to answer  independent queries.Let's see the following example: . Then Alice can choose the third pile, Bob can take the second pile, and then the only candy from the first pile goes to Bob — then Alice has  candies, and Bob has  candies.Another example is . Then Alice can choose the second pile, Bob can choose the first pile, and candies from the third pile can be divided in such a way that Bob takes  candies, and Alice takes  candies. Now Bob has  candies, and Alice has  candies, so she has to discard one candy — and after that, she has  candies too.", "input": "The first line of the input contains one integer  () — the number of queries. Then  queries follow. The only line of the query contains three integers  and  () — the number of candies in the first, second and third piles correspondingly.", "output": "Print  lines. The -th line should contain the answer for the -th query — the maximum number of candies Alice can have after the division, if both Alice and Bob act optimally (of course, Bob will have the same number of candies).", "tutorial": "The answer is always . Let's understand why it is so. Let . Then let Bob take the pile with  candies and Alice take the pile with  candies. Then because of  we can see that Bob's pile always can reach size of Alice's pile (and remaining candies can be divided between them fairly except one candy if  is odd).", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nint main() {\n#ifdef _DEBUG\n\tfreopen(\"input.txt\", \"r\", stdin);\n//\tfreopen(\"output.txt\", \"w\", stdout);\n#endif\n\t\n\tint q;\n\tcin >> q;\n\tfor (int i = 0; i < q; ++i) {\n\t\tlong long a, b, c;\n\t\tcin >> a >> b >> c;\n\t\tcout << (a + b + c) / 2 << endl;\n\t}\n\t\n\treturn 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}