{"link": "https://codeforces.com//contest/1729/problem/A", "problemId": "1538782", "shortId": "1729A", "contest_number": "1729", "name": "A. Two Elevators", "statement": "Vlad went into his appartment house entrance, now he is on the -th floor. He was going to call the elevator to go up to his apartment.There are only two elevators in his house. Vlad knows for sure that:  the first elevator is currently on the floor  (it is currently motionless),  the second elevator is located on floor  and goes to floor  (). Please note, if , then the elevator is already leaving the floor  and Vlad does not have time to enter it. If you call the first elevator, it will immediately start to go to the floor . If you call the second one, then first it will reach the floor  and only then it will go to the floor . It takes  seconds for each elevator to move from floor  to floor .Vlad wants to call an elevator that will come to him faster. Help him choose such an elevator.", "input": "The first line of the input contains the only  () — the number of test cases. This is followed by  lines, three integers each ,  and  (, ) — floor numbers described in the statement.", "output": "Output  numbers, each of which is the answer to the corresponding test case. As an answer, output:   , if it is better to call the first elevator;  , if it is better to call the second one;  , if it doesn't matter which elevator to call (both elevators will arrive in the same time). ", "tutorial": "You had to to calculate the time that each elevator would need and compare them. Let the time required by the first elevator be , and the time required by the second one be . Then the answer is  if ,  if  and  if ", "solution": "t = int(input())\nfor _ in range(t):\n    a, b, c = map(int, input().split())\n    d1 = a - 1\n    d2 = abs(b - c) + c - 1\n    ans = 0\n    if d1 <= d2:\n        ans += 1\n    if d1 >= d2:\n        ans += 2\n    print(ans)", "interactive": false, "noSolution": false, "noTutorial": false}