{"link": "https://codeforces.com//contest/1660/problem/A", "problemId": "1349755", "shortId": "1660A", "contest_number": "1660", "name": "A. Vasya and Coins", "statement": "Vasya decided to go to the grocery store. He found in his wallet  coins of  burle and  coins of  burles. He does not yet know the total cost of all goods, so help him find out  (): the  positive integer amount of money he  pay without change or pay at all using only his coins.For example, if  and  (he has one -burle coin and one -burle coin), then:  he can pay  burle without change, paying with one -burle coin,  he can pay  burle without change, paying with one -burle coin,  he can pay  burle without change by paying with one -burle coin and one -burle coin,  he cannot pay  burle without change (moreover, he cannot pay this amount at all). So for  and  the answer is .", "input": "The first line of the input contains an integer  () — the number of test cases in the test. The description of each test case consists of one line containing two integers  and  () — the number of -burle coins and -burles coins Vasya has respectively.", "output": "For each test case, on a separate line print one integer  (): the minimum positive integer amount of money that Vasya cannot pay without change or pay at all.", "tutorial": "If Vasya has  coins of  burles, then he can collect amounts of  burls. If Vasya does not have  burles coins, then he cannot collect the amount of  burle. If he has at least one coin in  burl, he can score odd amounts up to . The following burl coins increase the maximum amount he can make. If Vasya has  coins for  burle, he can make up the amount of  burles, and  - not anymore.", "solution": "#include <iostream>\n#include <vector>\n#include <algorithm>\n#include <set>\n \nusing namespace std;\n \nint main() {\n    int t;\n    cin >> t;\n    for (int it = 0; it < t; ++it) {\n        int a, b;\n        cin >> a >> b;\n        cout << (a == 0 ? 1 : a + 2 * b + 1) << '\\n';\n    }\n    return 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}