{"link": "https://codeforces.com//contest/1066/problem/A", "problemId": "235859", "shortId": "1066A", "contest_number": "1066", "name": "A. Vova and Train", "statement": "Vova plans to go to the conference by train. Initially, the train is at the point  and the destination point of the path is the point . The speed of the train is  length unit per minute (i.e. at the first minute the train is at the point , at the second minute — at the point  and so on).There are lanterns on the path. They are placed at the points with coordinates divisible by  (i.e. the first lantern is at the point , the second is at the point  and so on).There is also  one standing train which occupies all the points from  to  inclusive.Vova can see the lantern at the point  if  is divisible by  and there is no standing train at this position (). Thus, if the point with the lantern is one of the points covered by the standing train, Vova can't see this lantern.Your problem is to say the number of lanterns Vova will see during the path. Vova plans to go to  different conferences, so you should answer   queries.", "input": "The first line of the input contains one integer  () — the number of queries. Then  lines follow. The -th line contains four integers  (, ) — destination point of the -th path, the period of the lantern appearance and the segment occupied by the standing train.", "output": "Print  lines. The -th line should contain one integer — the answer for the -th query.", "tutorial": "What is the number of lanterns Vova will see from  to ? This number is . Now we have to subtract the number of lanters in range  from this number. This number equals to . So the answer is  -  + .", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nint main() {\n#ifdef _DEBUG\n\tfreopen(\"input.txt\", \"r\", stdin);\n//\tfreopen(\"output.txt\", \"w\", stdout);\n#endif\n\t\n\tint t;\n\tcin >> t;\n\t\n\tfor (int i = 0; i < t; ++i) {\t\n\t\tint L, v, l, r;\n\t\tcin >> L >> v >> l >> r;\n\t\tcout << L / v - r / v + (l - 1) / v << endl;\n\t}\n\t\n\treturn 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}