{"link": "https://codeforces.com//contest/1118/problem/A", "problemId": "300355", "shortId": "1118A", "contest_number": "1118", "name": "A. Water Buying", "statement": "Polycarp wants to cook a soup. To do it, he needs to buy exactly  liters of water.There are only two types of water bottles in the nearby shop — -liter bottles and -liter bottles. There are infinitely many bottles of these two types in the shop.The bottle of the first type costs  burles and the bottle of the second type costs  burles correspondingly.Polycarp wants to spend as few money as possible. Your task is to find the minimum amount of money (in burles) Polycarp needs to buy exactly  liters of water in the nearby shop if the bottle of the first type costs  burles and the bottle of the second type costs  burles. You also have to answer  independent queries.", "input": "The first line of the input contains one integer  () — the number of queries. The next  lines contain queries. The -th query is given as three space-separated integers ,  and  () — how many liters Polycarp needs in the -th query, the cost (in burles) of the bottle of the first type in the -th query and the cost (in burles) of the bottle of the second type in the -th query, respectively.", "output": "Print  integers. The -th integer should be equal to the minimum amount of money (in burles) Polycarp needs to buy exactly  liters of water in the nearby shop if the bottle of the first type costs  burles and the bottle of the second type costs  burles.", "tutorial": "The answer can be calculated by easy formula: , where  is  divided by  rounded down and  is  modulo .", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nint main() {\n#ifdef _DEBUG\n\tfreopen(\"input.txt\", \"r\", stdin);\n//\tfreopen(\"output.txt\", \"w\", stdout);\n#endif\n\t\n\tint q;\n\tcin >> q;\n\t\n\tfor (int i = 0; i < q; ++i) {\n\t\tlong long n;\n\t\tint a, b;\n\t\tcin >> n >> a >> b;\n\t\tcout << (n / 2) * min(2 * a, b) + (n % 2) * a << endl;\n\t}\n\t\n\treturn 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}