{"link": "https://codeforces.com//contest/1249/problem/A", "problemId": "447557", "shortId": "1249A", "contest_number": "1249", "name": "A. Yet Another Dividing into Teams", "statement": "You are a coach of a group consisting of  students. The -th student has programming skill . . You want to divide them into teams in such a way that:  No two students  and  such that  belong to the same team (i.e. skills of each pair of students in the same team have the difference strictly greater than );  the number of teams is the minimum possible. You have to answer  independent queries.", "input": "The first line of the input contains one integer  () — the number of queries. Then  queries follow. The first line of the query contains one integer  () — the number of students in the query. The second line of the query contains  integers  (, all  are distinct), where  is the programming skill of the -th student.", "output": "For each query, print the answer on it — the minimum number of teams you can form if no two students  and  such that  may belong to the same team (i.e. skills of each pair of students in the same team has the difference strictly greater than )", "tutorial": "The answer is always  or . Why it is so? Because if there is no such pair  among all students that  then we can take all students into one team. Otherwise, we can divide them into two teams by their programming skill parity.", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nint main() {\n#ifdef _DEBUG\n\tfreopen(\"input.txt\", \"r\", stdin);\n//\tfreopen(\"output.txt\", \"w\", stdout);\n#endif\n\t\n\tint q;\n\tcin >> q;\n\tfor (int i = 0; i < q; ++i) {\n\t\tint n;\n\t\tcin >> n;\n\t\tvector<int> a(n);\n\t\tfor (int j = 0; j < n; ++j) {\n\t\t\tcin >> a[j];\n\t\t}\n\t\tbool ok = true;\n\t\tfor (int p1 = 0; p1 < n; ++p1) {\n\t\t\tfor (int p2 = 0; p2 < p1; ++p2) {\n\t\t\t\tok &= abs(a[p1] - a[p2]) != 1;\n\t\t\t}\n\t\t}\n\t\tcout << 2 - ok << endl;\n\t}\n\t\n\treturn 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}