{"link": "https://codeforces.com//contest/1283/problem/B", "problemId": "504968", "shortId": "1283B", "contest_number": "1283", "name": "B. Candies Division", "statement": "Santa has  candies and he wants to gift them to  kids. He wants to divide as many candies as possible between all  kids. Santa can't divide one candy into parts but he is allowed to not use some candies at all.Suppose the kid who recieves the minimum number of candies has  candies and the kid who recieves the maximum number of candies has  candies. Then Santa will be , if the both conditions are met at the same time:   (it means  or );  the number of kids who has  candies () does not exceed  (less than or equal to ).  is  divided by  and rounded  to the nearest integer. For example, if  then .Your task is to find the maximum number of candies Santa can give to kids so that he will be .You have to answer  independent test cases.", "input": "The first line of the input contains one integer  () — the number of test cases. The next  lines describe test cases. The -th test case contains two integers  and  () — the number of candies and the number of kids.", "output": "For each test case print the answer on it — the maximum number of candies Santa can give to kids so that he will be .", "tutorial": "Firstly, we can notice that we always can distribute  (where  is the modulo operation) candies between kids. In this case  and the answer is at least . And then we can add the value  to the answer. Why? Because there is only  candies remain and the maximum number of kids to whom we can give one more candy is .", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nint main() {\n#ifdef _DEBUG\n\tfreopen(\"input.txt\", \"r\", stdin);\n//\tfreopen(\"output.txt\", \"w\", stdout);\n#endif\n\t\n\tint q;\n\tcin >> q;\n\tfor (int i = 0; i < q; ++i) {\n\t\tint n, k;\n\t\tcin >> n >> k;\n\t\tint full = n - n % k;\n\t\tfull += min(n % k, k / 2);\n\t\tcout << full << endl;\n\t}\n\t\n\treturn 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}