{"link": "https://codeforces.com//contest/1077/problem/B", "problemId": "256061", "shortId": "1077B", "contest_number": "1077", "name": "B. Disturbed People", "statement": "There is a house with  flats situated on the main street of Berlatov. Vova is watching this house every night. The house can be represented as an array of  integer numbers , where  if in the -th flat the light is on and  otherwise.Vova thinks that people in the -th flats are disturbed and cannot sleep if and only if  and  and .Vova is concerned by the following question: what is the minimum number  such that if people from exactly  pairwise distinct flats will turn off the lights then nobody will be disturbed? Your task is to find this number .", "input": "The first line of the input contains one integer  () — the number of flats in the house. The second line of the input contains  integers  (), where  is the state of light in the -th flat.", "output": "Print only one integer — the minimum number  such that if people from exactly  pairwise distinct flats will turn off the light then nobody will be disturbed.", "tutorial": "The first observation is that we are interested only in patterns of kind \"\". All other patterns don't make sense at all.So, let's build a greedy approach. Let's iterate over the given array from the left to the right and maintain that the prefix of the given answer is already correct. If now we are at some position ,  and  (and the prefix from  to  is already correct) then which one  we have to replace? When we replace the left one then we cannot do better in the future, but when we replace the right one then we can fix some on the suffix of the array.The easiest example is \"\". If now we are at the position  then we will do better if we will set .", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nint main() {\n#ifdef _DEBUG\n\tfreopen(\"input.txt\", \"r\", stdin);\n//\tfreopen(\"output.txt\", \"w\", stdout);\n#endif\n\t\n\tint n;\n\tcin >> n;\n\tvector<int> a(n);\n\tfor (int i = 0; i < n; ++i) {\n\t\tcin >> a[i];\n\t}\n\t\n\tint ans = 0;\n\tfor (int i = 1; i < n - 1; ++i) {\n\t\tif (a[i] == 0 && a[i - 1] == 1 && a[i + 1] == 1) {\n\t\t\t++ans;\n\t\t\ta[i + 1] = 0;\n\t\t}\n\t}\n\tcout << ans << endl;\n\t\n\treturn 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}