{"link": "https://codeforces.com//contest/1005/problem/B", "problemId": "196282", "shortId": "1005B", "contest_number": "1005", "name": "B. Delete from the Left", "statement": "You are given two strings  and . In a single move, you can choose any of two strings and delete the first (that is, the leftmost) character. After a move, the length of the string decreases by . You can't choose a string if it is empty.For example:  by applying a move to the string \"\", the result is the string \"\",  by applying a move to the string \"\", the result is an empty string \"\". You are required to make two given strings equal using the fewest number of moves. It is possible that, in the end, both strings will be equal to the empty string, and so, are equal to each other. In this case, the answer is obviously the sum of the lengths of the initial strings.Write a program that finds the minimum number of moves to make two given strings  and  equal.", "input": "The first line of the input contains . In the second line of the input contains . Both strings consist only of lowercase Latin letters. The number of letters in each string is between 1 and , inclusive.", "output": "Output the fewest number of moves required. It is possible that, in the end, both strings will be equal to the empty string, and so, are equal to each other. In this case, the answer is obviously the sum of the lengths of the given strings.", "tutorial": "Let's find the value  — the length of the longest common suffix of  and . You can easily find it in one linear loop: just compare the last letters of  and . If they are equal then compare before the last letters of  and . And so on.The last  letters of  and  are two equal strings which will be the result of after optimal moves. So the answer is .\n", "solution": "string s, t;\ncin >> s >> t;\nint w = 0;\nwhile (true) {\n    int i = s.length() - w - 1;\n    int j = t.length() - w - 1;\n    if (i >= 0 && j >= 0 && s[i] == t[j])\n        w++;\n    else\n        break;\n}\ncout << s.length() + t.length() - 2 * w << endl;", "interactive": false, "noSolution": false, "noTutorial": false}