{"link": "https://codeforces.com//contest/1367/problem/B", "problemId": "650994", "shortId": "1367B", "contest_number": "1367", "name": "B. Even Array", "statement": "You are given an array  of length  which consists of non-negative integers. An array is called  if the parity of each index matches the parity of the element at that index. More formally, an array is good if for all  () the equality  holds, where  is the remainder of dividing  by 2.For example, the arrays [] and [] are good, and the array [] is bad, because for , the parities of  and  are different: , but .In one move, you can take  two elements of the array and swap them (these elements are not necessarily adjacent).Find the minimum number of moves in which you can make the array  good, or say that this is not possible.", "input": "The first line contains a single integer  () — the number of test cases in the test. Then  test cases follow. Each test case starts with a line containing an integer  () — the length of the array . The next line contains  integers  () — the initial array.", "output": "For each test case, output a single integer — the minimum number of moves to make the given array  good, or  if this is not possible.", "tutorial": "We split all the positions in which the parity of the index does not match with the parity of the element into two arrays. If there is an odd number in the even index, add this index to the  array. Otherwise, if there is an even number in the odd index, add this index to the  array. Note that if the sizes of the  and  arrays are not equal, then there is no answer. Otherwise, the array  can be made  by doing exactly  operations by simply swapping all the elements in the  and  arrays.", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\nusing ld = long double;\nusing ll = long long;\n\nvoid solve() {\n    int n;\n    cin >> n;\n    int a = 0, b = 0;\n    for (int i = 0; i < n; i++) {\n        int x;\n        cin >> x;\n        if (x % 2 != i % 2) {\n            if (i % 2 == 0) {\n                a++;\n            } else {\n                b++;\n            }\n        }\n    }\n    if (a != b) {\n        cout << -1 << endl;\n    } else {\n        cout << a << endl;\n    }\n}\n\nint main() {\n    int n;\n    cin >> n;\n    while (n--) {\n        solve();\n    }\n}", "interactive": false, "noSolution": false, "noTutorial": false}