{"link": "https://codeforces.com//contest/1203/problem/B", "problemId": "388103", "shortId": "1203B", "contest_number": "1203", "name": "B. Equal Rectangles", "statement": "You are given  sticks, the length of the -th stick is .You have to create  rectangles, each rectangle will consist of exactly  sticks from the given set. The rectangle consists of four sides, opposite sides should have equal length and all angles in it should be right. Note that each stick can be used in only one rectangle. Each stick should be used as a side, you cannot break the stick or use it not to the full length.You want to all rectangles to have equal area. The area of the rectangle with sides  and  is .Your task is to say if it is possible to create exactly  rectangles of equal area or not.You have to answer  independent queries.", "input": "The first line of the input contains one integer  () — the number of queries. Then  queries follow. The first line of the query contains one integer  () — the number of rectangles. The second line of the query contains  integers  (), where  is the length of the -th stick.", "output": "For each query print the answer to it. If it is impossible to create exactly  rectangles of equal area using given sticks, print \"\". Otherwise print \"\".", "tutorial": "After sorting  we can observe that if the answer is \"\" then the area of each rectangle is . Then we just need to check for each  from  to  that  and  and . If all conditions are satisfied for all  then the answer is \"\". Otherwise the answer is \"\".", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nint main() {\n#ifdef _DEBUG\n\tfreopen(\"input.txt\", \"r\", stdin);\n//\tfreopen(\"output.txt\", \"w\", stdout);\n#endif\n\t\n\tint q;\n\tcin >> q;\n\tfor (int i = 0; i < q; ++i) {\n\t\tint n;\n\t\tcin >> n;\n\t\tvector<int> a(4 * n);\n\t\tfor (int j = 0; j < 4 * n; ++j) {\n\t\t\tcin >> a[j];\n\t\t}\n\t\tsort(a.begin(), a.end());\n\t\tint area = a[0] * a.back();\n\t\tbool ok = true;\n\t\tfor (int i = 0; i < n; ++i) {\n\t\t\tint lf = i * 2, rg = 4 * n - (i * 2) - 1;\n\t\t\tif (a[lf] != a[lf + 1] || a[rg] != a[rg - 1] || a[lf] * 1ll * a[rg] != area) {\n\t\t\t\tok = false;\n\t\t\t}\n\t\t}\n\t\tif (ok) cout << \"YES\" << endl;\n\t\telse cout << \"NO\" << endl;\n\t}\n\t\n\treturn 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}