{"link": "https://codeforces.com//contest/1759/problem/B", "problemId": "1648490", "shortId": "1759B", "contest_number": "1759", "name": "B. Lost Permutation", "statement": "A sequence of  numbers is called a permutation if it contains all integers from  to  exactly once. For example, the sequences [], [] and [] are permutations, but [], [] and [] — are not.Polycarp lost his favorite permutation and found only some of its elements — the numbers . He is sure that the sum of the lost elements equals .Determine whether one or more numbers can be appended to the given sequence  such that the sum of the added numbers equals , and the resulting new array is a permutation?", "input": "The first line of input contains a single integer  () —the number of test cases.  Then the descriptions of the test cases follow. The first line of each test set contains two integers  and  (, )—-the number of found elements and the sum of forgotten numbers. The second line of each test set contains  different integers  () — the elements Polycarp managed to find.", "output": "Print  lines, each of which is the answer to the corresponding test set. Print as the answer  if you can append several elements to the array , that their sum equals  and the result will be a permutation. Output  otherwise. You can output the answer in any case (for example, , ,  and  will be recognized as positive answer).", "tutorial": "Let us add to  the sum of the elements of the array  and try to find a suitable permutation. To do this, greedily add elements  until their sum is less than . And at the end we will check that the sum has matched. Also check that the maximal element from : , and that the total elements in : .", "solution": "t = int(input())\nfor _ in range(t):\n    n, s = map(int, input().split())\n    a = [int(x) for x in input().split()]\n    s += sum(a)\n    sm = 0\n    cnt = 0\n    for i in range(1, s + 1):\n        if sm >= s:\n            break\n        sm += i\n        cnt = i\n    if sm != s or max(a) > cnt or cnt <= n:\n        print(\"NO\");\n    else:\n        print(\"YES\")", "interactive": false, "noSolution": false, "noTutorial": false}