{"link": "https://codeforces.com//contest/1176/problem/B", "problemId": "356084", "shortId": "1176B", "contest_number": "1176", "name": "B. Merge it ", "statement": "You are given an array  consisting of  integers .In one operation you can choose two elements of the array and replace them with the element equal to their sum (it does not matter where you insert the new element). For example, from the array  you can obtain the following arrays: ,  and .Your task is to find the maximum possible number of elements divisible by  that are in the array after performing this operation an arbitrary (possibly, zero) number of times.You have to answer  independent queries.", "input": "The first line contains one integer  () — the number of queries. The first line of each query contains one integer  (). The second line of each query contains  integers  (). ", "output": "For each query print one integer in a single line — the maximum possible number of elements divisible by  that are in the array after performing described operation an arbitrary (possibly, zero) number of times.", "tutorial": "Let  be the number of elements of  with the remainder  modulo . Then the initial answer can be represented as  and we have to compose numbers with remainders  and  somehow optimally. It can be shown that the best way to do it is the following: firstly, while there is at least one remainder  and at least one remainder , let's compose them into one . After this, at least one of the numbers  will be zero, then we have to compose remaining numbers into numbers divisible by . If  then the maximum remaining number of elements we can obtain is  (because ), and in the other case ( the maximum number of elements is  (because ).", "solution": "#include<bits/stdc++.h>\n\nusing namespace std;\n\nint t, n;\nint cnt[3];\n\nint main(){\n    cin >> t;\n    for(int tc = 0; tc < t; ++tc){\n        memset(cnt, 0, sizeof cnt);\n        cin >> n;\n        for(int i = 0; i < n; ++i){\n            int x;\n            cin >> x;\n            ++cnt[x % 3];\n        }\n    \t\n    \tint res = cnt[0];\n        int mn = min(cnt[1], cnt[2]);\n        res += mn;\n        cnt[1] -= mn, cnt[2] -= mn;\n        res += (cnt[1] + cnt[2]) / 3;\n        cout << res << endl;\n    }\n    return 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}