{"link": "https://codeforces.com//contest/1475/problem/B", "problemId": "877134", "shortId": "1475B", "contest_number": "1475", "name": "B. New Year's Number", "statement": "Polycarp remembered the -th year, and he is happy with the arrival of the new -th year. To remember such a wonderful moment, Polycarp wants to represent the number  as the sum of a certain number of  and a certain number of .For example, if:   , then the number  can be represented as the sum ;  , then the number  can be represented as the sum ;  , then the number  can be represented as the sum ;  , then the number  cannot be represented as the sum of the numbers  and . Help Polycarp to find out whether the number  can be represented as the sum of a certain number of numbers  and a certain number of numbers .", "input": "The first line contains one integer  () — the number of test cases. Then  test cases follow. Each test case contains one integer  () — the number that Polycarp wants to represent as the sum of the numbers  and .", "output": "For each test case, output on a separate line:    \"\" if the number  is representable as the sum of a certain number of  and a certain number of ;  \"\" otherwise.  You can output \"\" and \"\" in any case (for example, the strings , ,  and  will be recognized as positive).", "tutorial": "Let  — the number of ,  — the number of  (). Let us write the required decomposition of the number :  Then we get that  is divisible by . Take  equal to the remainder of  divided by . Then  is uniquely determined from the formula above:  Then, if the result is that  ( because the remainder of dividing  by  is non-negative), then  can be represented as the sum of a certain number of  and a certain number of .", "solution": "#include <bits/stdc++.h>\n\n#include <utility>\nusing namespace std;\n\nusing pii = pair<int, int>;\n\nint main() {\n  int test;\n  cin >> test;\n  while (test-- > 0) {\n    int n;\n    cin >> n;\n    int cnt2021 = n % 2020;\n    int cnt2020 = (n - cnt2021) / 2020 - cnt2021;\n    if (cnt2020 >= 0 && 2020 * cnt2020 + 2021 * cnt2021 == n) {\n      cout << \"YES\\n\";\n    } else {\n      cout << \"NO\\n\";\n    }\n  }\n  return 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}