{"link": "https://codeforces.com//contest/1426/problem/B", "problemId": "741031", "shortId": "1426B", "contest_number": "1426", "name": "B. Symmetric Matrix", "statement": "Masha has  types of tiles of size . Each cell of the tile contains one integer. Masha has an  of tiles of each type.Masha decides to construct the square of size  consisting of the given tiles. This square also has to be a , and each cell of this square has to be covered with exactly one tile cell, and also sides of tiles should be parallel to the sides of the square. All placed tiles cannot intersect with each other. Also, each tile should lie inside the square. See the picture in Notes section for better understanding.Symmetric with respect to the main diagonal matrix is such a square  that for each pair  the condition  holds. I.e. it is true that the element written in the -row and -th column equals to the element written in the -th row and -th column.Your task is to determine if Masha can construct a square of size  which is a symmetric matrix and consists of tiles she has. Masha can use any number of tiles of each type she has to construct the square. Note that she  rotate tiles, she can only place them in the orientation they have in the input.You have to answer  independent test cases.", "input": "The first line of the input contains one integer  () — the number of test cases. Then  test cases follow. The first line of the test case contains two integers  and  (, ) — the number of types of tiles and the size of the square Masha wants to construct. The next  lines of the test case contain descriptions of tiles types. Types of tiles are written one after another, each type is written on two lines.  The first line of the description contains two positive (greater than zero) integers not exceeding  — the number written in the top left corner of the tile and the number written in the top right corner of the tile of the current type. The second line of the description contains two positive (greater than zero) integers not exceeding  — the number written in the bottom left corner of the tile and the number written in the bottom right corner of the tile of the current type. It is forbidden to rotate tiles, it is only allowed to place them in the orientation they have in the input.", "output": "For each test case print the answer: \"\" (without quotes) if Masha can construct the square of size  which is a symmetric matrix. Otherwise, print \"\" (withtout quotes).", "tutorial": "Firstly, if  is odd then the answer is \"\" by obvious reasons. Otherwise, we can notice that the top left and the bottom right values of the tile do not matter (since we can place tiles symmetrically). So we only need to check that there is some tile that its top right value equals its bottom left value (because this is how we get main diagonal symmetry).", "solution": "for i in range(int(input())):\n\tn, m = map(int, input().split())\n\ta = []\n\tfor i in range(n):\n\t\ta.append([[int(x) for x in input().split()] for i in range(2)])\n\tok = False\n\tfor i in range(n):\n\t\tok |= a[i][0][1] == a[i][1][0]\n\tok &= m % 2 == 0\n\tprint(\"YES\" if ok else \"NO\") ", "interactive": false, "noSolution": false, "noTutorial": false}