{"link": "https://codeforces.com//contest/1092/problem/B", "problemId": "271420", "shortId": "1092B", "contest_number": "1092", "name": "B. Teams Forming", "statement": "There are  students in a university. The number of students is even. The -th student has programming skill equal to . The coach wants to form  teams. Each team should consist of exactly two students, and each student should belong to exactly one team. Two students can form a team only if their skills are equal (otherwise they cannot understand each other and cannot form a team).Students can solve problems to increase their skill. One solved problem increases the skill by one.The coach wants to know the minimum total number of problems students should solve to form exactly  teams (i.e. each pair of students should form a team). Your task is to find this number.", "input": "The first line of the input contains one integer  () — the number of students. It is guaranteed that  is even. The second line of the input contains  integers  (), where  is the skill of the -th student.", "output": "Print one number — the minimum total number of problems students should solve to form exactly  teams.", "tutorial": "If we sort the students in order of non-decreasing their skill, we can see that the minimum cost of the team with the lowest skill (let's call it the first team) is equal to  (if  is already sorted), the cost of the second team is  and so on.So if we sort  in non-decreasing order then the answer is .", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nint main() {\n#ifdef _DEBUG\n\tfreopen(\"input.txt\", \"r\", stdin);\n//\tfreopen(\"output.txt\", \"w\", stdout);\n#endif\n\t\n\tint n;\n\tcin >> n;\n\tvector<int> a(n);\n\tfor (int i = 0; i < n; ++i) {\n\t\tcin >> a[i];\n\t}\n\t\n\tsort(a.begin(), a.end());\n\tint res = 0;\n\tfor (int i = 0; i < n; i += 2) {\n\t\tres += a[i + 1] - a[i];\n\t}\n\t\n\tcout << res << endl;\n\t\n\treturn 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}