{"link": "https://codeforces.com//contest/1611/problem/B", "problemId": "1202185", "shortId": "1611B", "contest_number": "1611", "name": "B. Team Composition  Programmers and Mathematicians", "statement": "The All-Berland Team Programming Contest will take place very soon. This year, teams of four are allowed to participate.There are  programmers and  mathematicians at Berland State University. How many maximum teams can be made if:  each team must consist of exactly  students,  teams of  mathematicians or  programmers are unlikely to perform well, so the decision was made not to compose such teams. Thus, each team must have at least one programmer  at least one mathematician.Print the required maximum number of teams. Each person can be a member of no more than one team.", "input": "The first line contains an integer  () —the number of test cases. This is followed by descriptions of  sets, one per line. Each set is given by two integers  and  ().", "output": "Print  lines. Each line must contain the answer to the corresponding set of input data — the required maximum number of teams.", "tutorial": "If necessary, change the values of  and  so that  is always true. Consider two cases.1. Let . Then:, .This means that the set  is at least  times larger than , and we can form  teams of the form , where one participant will be a programmer and three will be mathematicians.2. Let . Then assume that . Let's substitute this value into the inequality:, , Then we compose  commands of the form . Since making such a command decreases the value of  by 2. The new value , . The condition  still holds. Then make  commands of the form .The total number of commands is . That's what we wanted to get. ", "solution": "#include <bits/stdc++.h>\n \nusing namespace std;\nusing ll = long long;\n \nvoid solve() {\n    ll a, b;\n    cin >> a >> b;\n    cout << min(min(a, b), (a + b) / 4) << '\\n';\n}\n \nint main() {\n    int t;\n    cin >> t;\n    for (int i = 0; i < t; ++i) {\n        solve();\n    }\n    return 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}