{"link": "https://codeforces.com//contest/1551/problem/B1", "problemId": "1055220", "shortId": "1551B1", "contest_number": "1551", "name": "B1. Wonderful Coloring - 1", "statement": "Paul and Mary have a favorite string  which consists of lowercase letters of the Latin alphabet. They want to paint it using pieces of chalk of two colors: red and green. Let's call a coloring of a string wonderful if the following conditions are met:  each letter of the string is either painted in exactly one color (red or green) or isn't painted;  each two letters which are painted in the same color are different;  the number of letters painted in red is equal to the number of letters painted in green;  the number of painted letters of this coloring is  among all colorings of the string which meet the first three conditions. E. g. consider a string  equal to \"\". One of the wonderful colorings of the string is shown in the figure.     Paul and Mary want to learn by themselves how to find a wonderful coloring of the string. But they are very young, so they need a hint. Help them find  — the number of red (or green, these numbers are equal) letters in a wonderful coloring.", "input": "The first line contains one integer  () — the number of test cases. Then  test cases follow. Each test case consists of one non-empty string  which consists of lowercase letters of the Latin alphabet. The number of characters in the string doesn't exceed .", "output": "For each test case, output a separate line containing one non-negative integer  — the number of letters which will be painted in red in a wonderful coloring.", "tutorial": "Let's calculate the number of letters which occur exactly once in the string and letters that occur more than once —  and , respectively.If a letter occurs more than once, one of its occurrences may be painted in red and another one may be painted in green. We cannot paint all other occurrences because there will be two equal letters painted in one color, but this is unacceptable by the statement. So there are no more than  occurrences of letters that occur more than once to be painted in red. Let's select  such occurrences and paint them. We need to paint additionally the letters which occur exactly once by meeting the same conditions as we meet painting the whole string.There's no way to paint these letters and not meet the first two conditions. So we must select the maximal count of the letters so that we will be able to paint some set of remaining letters in green so that the number of red letters will be equal to the number of green letters. This number is equal to .So the final answer is equal to .", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nconst int L = 26;\nint cnt[L];\n\nint main()\n{\n\tint t;\n\tcin >> t;\n\twhile (t--)\n\t{\n\t\tstring s;\n\t\tcin >> s;\n\t\tmemset(cnt, 0, sizeof(cnt));\n\t\tfor (auto c : s) cnt[c - 'a']++;\n\t\tint cnt1 = 0;\n\t\tint cnt2 = 0;\n\t\tfor (int i = 0; i < L; i++)\n\t\t\tif (cnt[i] == 1)\n\t\t\t\tcnt1++;\n\t\t\telse if (cnt[i] > 0)\n\t\t\t\tcnt2++;\n\t\tcout << (cnt2 + cnt1 / 2) << endl;\n\t}\n\treturn 0;\n}\n", "interactive": false, "noSolution": false, "noTutorial": false}