{"link": "https://codeforces.com//contest/1102/problem/C", "problemId": "280229", "shortId": "1102C", "contest_number": "1102", "name": "C. Doors Breaking and Repairing", "statement": "You are policeman and you are playing a game with Slavik. The game is turn-based and each turn consists of two phases. During the first phase you make your move and during the second phase Slavik makes his move.There are  doors, the -th door initially has durability equal to .During your move you can try to break one of the doors. If you choose door  and its current durability is  then you reduce its durability to  (the value  is given).During Slavik's move he tries to repair one of the doors. If he chooses door  and its current durability is  then he increases its durability to  (the value  is given). .The game lasts  turns. If some player cannot make his move then he has to skip it.Your goal is to maximize the number of doors with durability equal to  at the end of the game. You can assume that Slavik  the number of such doors. What is the number of such doors in the end if you both play optimally?", "input": "The first line of the input contains three integers ,  and  (, ) — the number of doors, value  and value , respectively. The second line of the input contains  integers  (), where  is the initial durability of the -th door.", "output": "Print one integer — the number of doors with durability equal to  at the end of the game, if you and Slavik both play optimally.", "tutorial": "Let's consider two cases:If  then the answer is  because we can make opposite moves to the Slavik's moves and it always will reduce durability of some door (so at some point we will reach the state when all doors will have durability ).Otherwise  and we have to realize the optimal strategy for us. If we have some door with durability  then let's break it immediately (why shouldn't we do this?). If we don't do it then Slavik will repair this door during his move. So what Slavik will do now? He will repair some door. Which door he has to repair? Of course the one with durability  because otherwise we will break it during our next move. So we can realize that doors with durability  are not interesting for us because Slavik will make opposite moves to our moves. And what is the answer if the number of doors with durability  equals to ? It is .", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nint main() {\n#ifdef _DEBUG\n\tfreopen(\"input.txt\", \"r\", stdin);\n//\tfreopen(\"output.txt\", \"w\", stdout);\n#endif\n\t\n\tint n, x, y;\n\tcin >> n >> x >> y;\n\tint cnt = 0;\n\tfor (int i = 0; i < n; ++i) {\n\t\tint cur;\n\t\tcin >> cur;\n\t\tif (cur <= x) {\n\t\t\t++cnt;\n\t\t}\n\t}\n\t\n\tif (x > y) {\n\t\tcout << n << endl;\n\t} else {\n\t\tcout << (cnt + 1) / 2 << endl;\n\t}\n\t\n\treturn 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}