{"link": "https://codeforces.com//contest/978/problem/C", "problemId": "182878", "shortId": "978C", "contest_number": "978", "name": "C. Letters", "statement": "There are  dormitories in Berland State University, they are numbered with integers from  to . Each dormitory consists of rooms, there are  rooms in -th dormitory. The rooms in -th dormitory are numbered from  to .A postman delivers letters. Sometimes there is no specific dormitory and room number in it on an envelope. Instead of it only a room number among all rooms of all  dormitories is written on an envelope. In this case, assume that all the rooms are numbered from  to  and the rooms of the first dormitory go first, the rooms of the second dormitory go after them and so on.For example, in case ,  and  an envelope can have any integer from  to  written on it. If the number  is written on an envelope, it means that the letter should be delivered to the room number  of the second dormitory.For each of  letters by the room number among all  dormitories, determine the particular dormitory and the room number in a dormitory where this letter should be delivered.", "input": "The first line contains two integers  and   — the number of dormitories and the number of letters. The second line contains a sequence  , where  equals to the number of rooms in the -th dormitory. The third line contains a sequence  , where  equals to the room number (among all rooms of all dormitories) for the -th letter. All  are given in  order.", "output": "Print  lines. For each letter print two integers  and  — the dormitory number   and the room number  in this dormitory  to deliver the letter.", "tutorial": "We should use that the letter queries are given in increasing order of room numbers. We will store in a variable  the number of rooms in already considered dormitories (this variable should have 64-bit type) and in a variable  we will store the minimum number of dormitory where the room from the current letter possibly is. Initially,  and . We will iterate through the letters. Let the current letter should be delivered to the room . While , we increase  by  and increase  by one. So, we got the dormitory number where room  is. It only remains to print two integers:  (the dormitory number) and  (the room number in this dormitory).", "solution": "#include <bits/stdc++.h>\n#define DIM 200007\nusing namespace std;\n\nlong long n,m,a[DIM],p[DIM];\n\n\nint main()\n{\n    cin>>n>>m;\n\n    for(int i = 1; i <= n; ++i)\n    {\n        cin>>a[i];\n        p[i] = p[i-1] + a[i];\n    }\n\n    for(int i = 1; i <= m; ++i)\n    {\n        long long b;\n        cin>>b;\n        int pos = lower_bound(p+1,p+1+n,b) - p;\n        cout<<pos<<' '<<b-p[pos-1]<<endl;\n    }\n    return 0;\n\n}\n", "interactive": false, "noSolution": false, "noTutorial": false}