{"link": "https://codeforces.com//contest/1196/problem/C", "problemId": "377792", "shortId": "1196C", "contest_number": "1196", "name": "C. Robot Breakout", "statement": " robots have escaped from your laboratory! You have to find them as soon as possible, because these robots are experimental, and their behavior is not tested yet, so they may be really dangerous!Fortunately, even though your robots have escaped, you still have some control over them. First of all, you know the location of each robot: the world you live in can be modeled as an infinite coordinate plane, and the -th robot is currently located at the point having coordinates (, ). Furthermore, you may send exactly one command to all of the robots. The command should contain two integer numbers  and , and when each robot receives this command, it starts moving towards the point having coordinates (, ). The robot stops its movement in two cases:  either it reaches (, );  or it cannot get any closer to (, ). Normally, all robots should be able to get from any point of the coordinate plane to any other point. Each robot usually can perform four actions to move. Let's denote the current coordinates of the robot as (, ). Then the movement system allows it to move to any of the four adjacent points:  the first action allows it to move from (, ) to (, );  the second action allows it to move from (, ) to (, );  the third action allows it to move from (, ) to (, );  the fourth action allows it to move from (, ) to (, ). Unfortunately, it seems that some movement systems of some robots are malfunctioning. For each robot you know which actions it can perform, and which it cannot perform.You want to send a command so all robots gather at the same point. To do so, you have to choose a pair of integer numbers  and  so that each robot can reach the point (, ). Is it possible to find such a point?", "input": "The first line contains one integer  () — the number of queries. Then  queries follow. Each query begins with one line containing one integer  () — the number of robots in the query. Then  lines follow, the -th of these lines describes the -th robot in the current query: it contains six integer numbers , , , ,  and  (, ). The first two numbers describe the initial location of the -th robot, and the following four numbers describe which actions the -th robot can use to move ( if the -th robot can use the -th action, and  if it cannot use the -th action). It is guaranteed that the total number of robots over all queries does not exceed .", "output": "You should answer each query independently, in the order these queries appear in the input. To answer a query, you should do one of the following:   if it is impossible to find a point that is reachable by all  robots, print one number  on a separate line;  if it is possible to find a point that is reachable by all  robots, print three space-separated integers on the same line:   , where  and  are the coordinates of the point reachable by all  robots. .", "tutorial": "In fact, we have some restrictions on  axis and  axis (for example, if some robot stays at the position  and cannot move to the left, then the answer point should have ).So we can take the minimum among all -coordinates of robots that cannot go up and save it into , maximum among all -coordinates of robots that cannot go down and save it into , minimum among all -coordinates of robots that cannot go right and save it into  and maximum among all -coordinates of robots that cannot go right and save it into . Initially .So these restrictions are describe some rectangle (possibly incorrect, with  or ). Let  be the bottom-left point of this rectangle and  be the top-right point of this rectangle.In case if this rectangle have  or , the answer is \"\". Otherwise this rectangle describes all integer points which can be reachable all robots and you can print any of them.", "solution": "#include <algorithm>\n#include <iostream>\n\nusing namespace std;\n\nconst int MAXC = 1e5;\n\nint main() {\n    int q;\n    cin >> q;\n    while (q--) {\n        int n;\n        cin >> n;\n        int mnx = -MAXC, mxx = MAXC;\n        int mny = -MAXC, mxy = MAXC;\n        while (n--) {\n            int x, y, f1, f2, f3, f4;\n            cin >> x >> y >> f1 >> f2 >> f3 >> f4;\n            if (!f1) mnx = max(mnx, x);\n            if (!f2) mxy = min(mxy, y);\n            if (!f3) mxx = min(mxx, x);\n            if (!f4) mny = max(mny, y);\n        }\n        if (mnx <= mxx && mny <= mxy)\n            cout << \"1 \" << mnx << \" \" << mny << \"\\n\";\n        else\n            cout << \"0\\n\";\n    }\n\n    return 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}