{"link": "https://codeforces.com//contest/1462/problem/C", "problemId": "833571", "shortId": "1462C", "contest_number": "1462", "name": "C. Unique Number", "statement": "You are given a positive number . Find the smallest positive integer number that has the sum of digits equal to  and all digits are  (unique).", "input": "The first line contains a single positive integer  () — the number of test cases in the test. Then  test cases follow. Each test case consists of a single integer number  ().", "output": "Output  answers to the test cases:   if a positive integer number with the sum of digits equal to  and all digits are different exists, print the smallest such number;  otherwise print . ", "tutorial": "First of all, let's understand that the answer to the problem should not contain zeros (leading zeros are useless, while others increase the number, but do not change the sum). It is also clear that the number we found should have the minimum possible length (since the longer the numbers without leading zeros, the larger they are). Numbers of the same length are compared lexicographically, that is, first by the first digit, then by the second, and so on. This means that the digits in the number must go in sorted order (the order of the digits does not affect the sum, but does affect the value).Let's minimize the length of the number first. We need to get the specified sum in as few digits as possible. So we should use as large digits as possible. Then let's start with the number $$$9$$$ and add the digits from $$$8$$$ to $$$1$$$ to the beginning of the number in turn, until the sum of the digits exceeds the specified sum. Obviously, you can't get an answer for fewer digits.Now we minimize the number itself. First, we must minimize the first digit. The first digit is uniquely determined as the difference between the sum of the remaining digits and the required sum. So you need to maximize the sum of all digits except the first one (which has already been done in the previous paragraph). It only remains to correct the first digit and print the answer.", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nvoid solve() {\n  int x;\n  cin >> x;\n  vector<int> ans;\n  int sum = 0, last = 9;\n  while (sum < x && last > 0) {\n    ans.push_back(min(x - sum, last));\n    sum += last;\n    last--;\n  }\n  if (sum < x) {\n    cout << -1 << \"\\n\";\n  } else {\n    reverse(ans.begin(), ans.end());\n    for (int i : ans) {\n      cout << i;\n    }\n    cout << \"\\n\";\n  }\n}\n\nint main() {\n  int t;\n  cin >> t;\n  while (t--) {\n    solve();\n  }\n}", "interactive": false, "noSolution": false, "noTutorial": false}