{"link": "https://codeforces.com//contest/1335/problem/D", "problemId": "592974", "shortId": "1335D", "contest_number": "1335", "name": "D. Anti-Sudoku", "statement": "You are given a correct solution of the sudoku puzzle. If you don't know what is the sudoku, you can read about it here.The picture showing the correct sudoku solution:Blocks are bordered with bold black color.Your task is to change   elements of this field (i.e. choose some  and change the number at the position  to any other number in range ) to make it . The  is the  field, in which:  Any number in this field is in range ;  each row contains at least two equal elements;  each column contains at least two equal elements;  each  block (you can read what is the block in the link above) contains at least two equal elements. It is guaranteed that the answer exists.You have to answer  independent test cases.", "input": "The first line of the input contains one integer  () — the number of test cases. Then  test cases follow. Each test case consists of  lines, each line consists of  characters from  to  without any whitespaces — the correct solution of the sudoku puzzle.", "output": "For each test case, print the answer — the initial field with   changed elements so that the obtained field is . If there are several solutions, you can print any. It is guaranteed that the answer exists.", "tutorial": "Well, if we replace all occurrences of the number  with the number , then the initial solution will be anti-sudoku. It is easy to see that this replacement will make exactly two copies of  in every row, column, and block. There are also other correct approaches but I found this one the most pretty.", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nint main() {\n#ifdef _DEBUG\n\tfreopen(\"input.txt\", \"r\", stdin);\n//\tfreopen(\"output.txt\", \"w\", stdout);\n#endif\n\t\n\tint t;\n\tcin >> t;\n\twhile (t--) {\n\t\tfor (int i = 0; i < 9; ++i) {\n\t\t\tstring s;\n\t\t\tcin >> s;\n\t\t\tfor (auto &c : s) if (c == '2') c = '1';\n\t\t\tcout << s << endl;\n\t\t}\n\t}\n\t\n\treturn 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}