{"link": "https://codeforces.com//contest/1690/problem/D", "problemId": "1423052", "shortId": "1690D", "contest_number": "1690", "name": "D. Black and White Stripe", "statement": "You have a stripe of checkered paper of length . Each cell is either white or black.What is the minimum number of cells that must be recolored from white to black in order to have a segment of  consecutive black cells on the stripe?If the input data is such that a segment of  consecutive black cells already exists, then print . ", "input": "The first line contains an integer  () — the number of test cases. Next, descriptions of  test cases follow. The first line of the input contains two integers  and  (). The second line consists of the letters '' (white) and '' (black). The line length is . It is guaranteed that the sum of values  does not exceed .", "output": "For each of  test cases print an integer — the minimum number of cells that need to be repainted from white to black in order to have a segment of  consecutive black cells.", "tutorial": "To obtain a segment of  cells of black color, we need to paint all the white cells of the segment black. Then go through all the segments of length  (there are only ) and choose such a segment among them that the number of white cells on it is minimal. You can quickly find out the number of white cells in the segment by prefix sums. ", "solution": "#include <bits/stdc++.h>\n \nusing namespace std;\n \n#define forn(i, n) for (int i = 0; i < int(n); i++)\n \nint main() {\n    int t;\n    cin >> t;\n    forn(tt, t) {\n        int n, k;\n        cin >> n >> k;\n        string s;\n        cin >> s;\n        vector<int> w(n + 1);\n        for (int i = 1; i <= n; i++)\n            w[i] = w[i - 1] + int(s[i - 1] == 'W');\n        int result = INT_MAX;\n        for (int i = k; i <= n; i++)\n            result = min(result, w[i] - w[i - k]);\n        cout << result << endl;\n    }\n}", "interactive": false, "noSolution": false, "noTutorial": false}