{"link": "https://codeforces.com//contest/1624/problem/D", "problemId": "1256440", "shortId": "1624D", "contest_number": "1624", "name": "D. Palindromes Coloring", "statement": "You have a string  consisting of lowercase Latin alphabet letters. You can color some letters in colors from  to . It is not necessary to paint all the letters. But for each color, there must be a letter painted in that color.Then you can swap any two symbols painted in the same color as many times as you want. After that,  strings will be created, -th of them will contain all the characters colored in the color , written in the order of their sequence in the string .Your task is to color the characters of the string so that all the resulting  strings are palindromes, and the length of the shortest of these  strings is as  as possible.Read the note for the first test case of the example if you need a clarification.Recall that a string is a palindrome if it reads the same way both from left to right and from right to left. For example, the strings , ,  and  are palindromes, but the strings  and  — are not.", "input": "The first line of input data contains a single integer  () — the number of input data sets in the test.  The descriptions of the input data sets follow. The first line of the description of each input data set contains two integers  and  () — the length of the string and the number of colors in which its letters can be painted. The second line of the description of each input data set contains a string  of length  consisting of lowercase letters of the Latin alphabet. It is guaranteed that the sum of n over all test cases does not exceed .", "output": "For each set of input data, output a single integer  — the maximum length of the shortest palindrome string that can be obtained.", "tutorial": "We will solve the problem greedily. First, we will try to add pairs of identical characters to palindromes. As long as there are at least  pairs, let's add them. After that, it is no longer possible to add a couple of characters, but you can try to add one character in the middle. This can be done if there are at least  characters left. There is no need to paint other characters.", "solution": "#include <iostream>\n#include <vector>\n#include <stack>\n#include <algorithm>\n\nusing namespace std;\n\ntypedef long long ll;\nconst int MAX_N = 2e5;\n\nint main(int argc, char* argv[]) {\n    int t;\n    cin >> t;\n    for (int _ = 0; _ < t; ++_) {\n        int n, k;\n        string s;\n        cin >> n >> k >> s;\n        vector<int> cnt(26);\n        for (char c : s) {\n            cnt[c - 'a']++;\n        }\n        int cntPairs = 0, cntOdd = 0;\n        for (int c : cnt) {\n            cntPairs += c / 2;\n            cntOdd += c % 2;\n        }\n        int ans = 2 * (cntPairs / k);\n        cntOdd += 2 * (cntPairs % k);\n        if (cntOdd >= k) {\n            ans++;\n        }\n        cout << ans << '\\n';\n    }\n}", "interactive": false, "noSolution": false, "noTutorial": false}