{"link": "https://codeforces.com//contest/1475/problem/E", "problemId": "877137", "shortId": "1475E", "contest_number": "1475", "name": "E. Advertising Agency", "statement": "Masha works in an advertising agency. In order to promote the new brand, she wants to conclude contracts with some bloggers. In total, Masha has connections of  different bloggers. Blogger numbered  has  followers.Since Masha has a limited budget, she can only sign a contract with  different bloggers. Of course, Masha wants her ad to be seen by as many people as possible. Therefore, she must hire bloggers with the maximum total number of followers.Help her, find the number of ways to select  bloggers so that the total number of their followers is maximum possible. Two ways are considered different if there is at least one blogger in the first way, which is not in the second way. Masha believes that all bloggers have different followers (that is, there is no follower who would follow two different bloggers).For example, if , , , then Masha has two ways to select  bloggers with the maximum total number of followers:   conclude contracts with bloggers with numbers ,  and . In this case, the number of followers will be equal to .  conclude contracts with bloggers with numbers ,  and . In this case, the number of followers will be equal to . Since the answer can be quite large, .", "input": "The first line contains one integer  () — the number of test cases. Then  test cases follow. The first line of each test case contains two integers  and  () — the number of bloggers and how many of them you can sign a contract with. The second line of each test case contains  integers  () — the number of followers of each blogger. It is guaranteed that the sum of  over all test cases does not exceed .", "output": "For each test case, on a separate line output one integer — the number of ways to select  bloggers so that the total number of their followers is maximum possible.", "tutorial": "It is obvious that Masha will enter into agreements only with bloggers that have the most subscribers. You can sort all the bloggers and greedily select the prefix.Let  — be the minimum number of subscribers for the hired blogger. Then we must hire all the bloggers who have more subscribers. Let  — the number of bloggers who have more than  subscribers,  — the number of bloggers who have exactly  subscribers. Then we should select  bloggers from . The number of ways to do this is equal to the binomial coefficient of  by .You could calculate it by searching for the inverse element modulo. Then you could calculate the factorials and use the equality .Alternatively, you can use the equation  and calculate it using dynamic programming. This method is better known as the Pascal triangle.", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\nusing ll = long long;\nusing ld = long double;\n\nint mod = 1e9 + 7;\n\nint fast_pow(int a, int p) {\n  int res = 1;\n  while (p) {\n    if (p % 2 == 0) {\n      a = a * 1ll * a % mod;\n      p /= 2;\n    } else {\n      res = res * 1ll * a % mod;\n      p--;\n    }\n  }\n  return res;\n}\n\nint fact(int n) {\n  int res = 1;\n  for (int i = 1; i <= n; i++) {\n    res = res * 1ll * i % mod;\n  }\n  return res;\n}\n\nint C(int n, int k) {\n  return fact(n) * 1ll * fast_pow(fact(k), mod - 2) % mod * 1ll * fast_pow(fact(n - k), mod - 2) % mod;\n}\n\nvoid solve() {\n  int n, k;\n  cin >> n >> k;\n  vector<int> cnt(n + 1);\n  for (int i = 0; i < n; i++) {\n    int x;\n    cin >> x;\n    cnt[x]++;\n  }\n  for (int i = n; i >= 0; i--) {\n    if (cnt[i] >= k) {\n      cout << C(cnt[i], k) << \"\\n\";\n      return;\n    } else {\n      k -= cnt[i];\n    }\n  }\n  cout << 1;\n}\n\nint main() {\n  int t;\n  cin >> t;\n  while (t--) {\n    solve();\n  }\n}", "interactive": false, "noSolution": false, "noTutorial": false}