{"link": "https://codeforces.com//contest/1118/problem/E", "problemId": "300360", "shortId": "1118E", "contest_number": "1118", "name": "E. Yet Another Ball Problem", "statement": "The king of Berland organizes a ball!  pair are invited to the ball, they are numbered from  to . Each pair consists of one man and one woman. Each dancer (either man or woman) has a monochrome costume. The color of each costume is represented by an integer from  to , inclusive.Let  be the color of the man's costume and  be the color of the woman's costume in the -th pair. You have to choose a color for each dancer's costume (i.e. values  and ) in such a way that:  for every :  and  are integers between  and , inclusive;  there are no two completely identical pairs, i.e. no two indices  () such that  and  at the same time;  there is no pair such that the color of the man's costume is the same as the color of the woman's costume in this pair, i.e.  for every ;  for each two consecutive (adjacent) pairs both man's costume colors and woman's costume colors differ, i.e. for every  from  to  the conditions  and  hold. Let's take a look at the examples of bad and good color choosing (for  and , man is the first in a pair and woman is the second):Bad color choosing:   , , ,  — contradiction with the second rule (there are equal pairs);  , , ,  — contradiction with the third rule (there is a pair with costumes of the same color);  , , ,  — contradiction with the fourth rule (there are two consecutive pairs such that colors of costumes of men/women are the same). Good color choosing:   , , , ;  , , , ;  , , , . You have to find  suitable color choosing or say that no suitable choosing exists.", "input": "The only line of the input contains two integers  and  () — the number of pairs and the number of colors.", "output": "If it is impossible to find  suitable colors choosing, print \"\". Otherwise print \"\" and then the colors of the costumes of pairs in the next  lines. The -th line should contain two integers  and  — colors of costumes of man and woman in the -th pair, respectively. You can print each letter in any case (upper or lower). For example, \"\", \"\" and \"\" are all acceptable.", "tutorial": "The first observation: we cannot construct more than  pairs at all due to second and third rules.The second observation: we always can construct an answer which will contain all  pairs (and get some prefix of this answer if we need less than  pairs). Ho do we do that?Let man's costumes colors be in the following order:  and so on. Now we have to set some colors to woman's costumes. The first thing comes to mind is to use some cyclic shift of . And it is the best thing we can do! So let women's costumes colors be in the following order:  ans so on. So we use each cyclic shift of  in order from second to last. The maximum number of pairs can be obtained when  and the number of such pairs is .So now we have to prove that second, third and fourth rules are satisfied (or write a stress test, it is not so hard to do it). The easiest way to prove all rules are satisfied is the following: if some element  in the left part has position  (let's consider all positions modulo ) then each element  in the right part will have all positions expect  in order  (you can see it from our placement). Now we can see that all rules are satisfied because of such a placement.", "solution": "#include <bits/stdc++.h>\n\nusing namespace std;\n\nint main() {\n#ifdef _DEBUG\n\tfreopen(\"input.txt\", \"r\", stdin);\n//\tfreopen(\"output.txt\", \"w\", stdout);\n#endif\n\t\n\tint n, k;\n\tcin >> n >> k;\n\t\n\tif (n > k * 1ll * (k - 1)) {\n\t\tcout << \"NO\" << endl;\n\t} else {\n\t\tcout << \"YES\" << endl;\n\t\tint cur = 0;\n\t\tfor (int i = 0; i < n; ++i) {\n\t\t\tcur += (i % k == 0);\n\t\t\tcout << i % k + 1 << \" \" << (cur + i % k) % k + 1 << endl;\n\t\t}\n\t}\n\t\n\treturn 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}