{"link": "https://codeforces.com//contest/1360/problem/G", "problemId": "629827", "shortId": "1360G", "contest_number": "1360", "name": "G. A B Matrix", "statement": "You are given four positive integers , , ,  (; ). Find any such rectangular matrix of size  that satisfies all of the following conditions:  each row of the matrix contains exactly  ones;  each column of the matrix contains exactly  ones;  all other elements are zeros. If the desired matrix does not exist, indicate this.For example, for , , , , there exists a matrix satisfying the conditions above:", "input": "The first line contains an integer  () — the number of test cases. Then  test cases follow. Each test case is described by four positive integers , , ,  (; ), where  and  are the sizes of the matrix, and  and  are the number of ones for rows and columns, respectively.", "output": "For each test case print:   \"YES\" (without quotes) and the required matrix (if there are several answers, print any) if it exists, or  \"NO\" (without quotes) if it does not exist.  To print the matrix , print  rows, each of which consists of  numbers  or  describing a row of the matrix. Numbers must be printed .", "tutorial": "Let's see how the desired matrix looks like. Since each row should have exactly  ones, and each column should have exactly  ones, the number of ones in all rows  should be equal to the number of ones in all columns . Thus, the desired matrix exists iff  or .Let's show how to construct the desired matrix if it exists. Let's find any number  such that , where  — is the remainder of dividing  by . In the first row of the desired matrix, we put the ones at the positions , and in the -th row we put the ones, as in the  row, but cyclically shifted by  to the right.", "solution": "#include <bits/stdc++.h>\nusing namespace std;\n\nint main() {\n  int test;\n  cin >> test;\n\n  for (int tt = 0; tt < test; tt++) {\n    int h, w, a, b;\n    cin >> h >> w >> a >> b;\n\n    if (h * a != w * b) {\n      cout << \"NO\" << endl;\n      continue;\n    }\n\n    vector<vector<int>> result(h, vector<int>(w, 0));\n\n    int shift = 0;\n\n    for (shift = 1; shift < w; shift++) {\n      if (shift * h % w == 0) {\n        break;\n      }\n    }\n\n    for (int i = 0, dx = 0; i < h; i++, dx += shift) {\n      for (int j = 0; j < a; j++) {\n        result[i][(j + dx) % w] = 1;\n      }\n    }\n\n    cout << \"YES\" << endl;\n\n    for (int i = 0; i < h; i++) {\n      for (int j = 0; j < w; j++) {\n        cout << result[i][j];\n      }\n\n      cout << endl;\n    }\n  }\n\n  return 0;\n}", "interactive": false, "noSolution": false, "noTutorial": false}